# 1565

In [14]:
df1565= {"headers":{"Orders":["order_id","order_date","customer_id","invoice"]},"rows":{"Orders":[[1,"2020-09-15",1,30],[2,"2020-09-17",2,90],[3,"2020-10-06",3,20],[4,"2020-10-20",3,21],[5,"2020-11-10",1,10],[6,"2020-11-21",2,15],[7,"2020-12-01",4,55],[8,"2020-12-03",4,77],[9,"2021-01-07",3,31],[10,"2021-01-15",2,20]]}}

In [47]:
import pandas as pd

In [18]:
dic1565

{'Orders': [[1, '2020-09-15', 1, 30],
  [2, '2020-09-17', 2, 90],
  [3, '2020-10-06', 3, 20],
  [4, '2020-10-20', 3, 21],
  [5, '2020-11-10', 1, 10],
  [6, '2020-11-21', 2, 15],
  [7, '2020-12-01', 4, 55],
  [8, '2020-12-03', 4, 77],
  [9, '2021-01-07', 3, 31],
  [10, '2021-01-15', 2, 20]]}

In [28]:
newlist = list(dic1565.values())

In [32]:
df1565 = pd.DataFrame([item for items in newlist for item in items], columns = ["order_id","order_date","customer_id","invoice"])

In [35]:
df1565['month'] = pd.to_datetime(df1565['order_date']).dt.to_period('M')

In [39]:
dat1565 = df1565[df1565['invoice']>20].groupby(['month']).agg({'order_id': 'nunique', 'customer_id': 'nunique'}).reset_index()

In [44]:
dat1565.sort_values('month',inplace=True, ascending= True)

In [45]:
dat1565.columns =['month', 'order_count','customer_count']

In [46]:
dat1565

     month  order_count  customer_count
0  2020-09            2               2
1  2020-10            1               1
2  2020-12            2               1
3  2021-01            1               1

# 1809

In [48]:
df1809={"headers":{"Playback":["session_id","customer_id","start_time","end_time"],"Ads":["ad_id","customer_id","timestamp"]},"rows":{"Playback":[[1,1,1,5],[2,1,15,23],[3,2,10,12],[4,2,17,28],[5,2,2,8]],"Ads":[[1,1,5],[2,2,17],[3,2,20]]}}

In [49]:
new_vals = list(df1809.values())

In [58]:
df1809.values()

dict_values([{'Playback': ['session_id', 'customer_id', 'start_time', 'end_time'], 'Ads': ['ad_id', 'customer_id', 'timestamp']}, {'Playback': [[1, 1, 1, 5], [2, 1, 15, 23], [3, 2, 10, 12], [4, 2, 17, 28], [5, 2, 2, 8]], 'Ads': [[1, 1, 5], [2, 2, 17], [3, 2, 20]]}])

In [54]:
df1809.keys()

dict_keys(['headers', 'rows'])

In [66]:
test = dict(list(newlist)[1])

In [71]:
wanted_keys = ['Playback'] # The keys you want
Playback = list(dict((k, test[k]) for k in wanted_keys if k in test).values())

In [72]:
Playback = pd.DataFrame([item for items in Playback for item in items], columns = ["session_id","customer_id","start_time","end_time"])

In [73]:
Playback

   session_id  customer_id  start_time  end_time
0           1            1           1         5
1           2            1          15        23
2           3            2          10        12
3           4            2          17        28
4           5            2           2         8

In [77]:
wanted_keys = ['Ads'] # The keys you want
Ads = list(dict((k, test[k]) for k in wanted_keys if k in test).values())

In [87]:
Ads = pd.DataFrame([item for items in Ads for item in items], columns = list(list(newlist)[0].values())[1])

In [84]:
list(list(newlist)[0].values())[1]

['ad_id', 'customer_id', 'timestamp']

In [88]:
Ads

   ad_id  customer_id  timestamp
0      1            1          5
1      2            2         17
2      3            2         20

In [95]:
Playback[Playback['customer_id'](Ads['customer_id']))]

   session_id  customer_id  start_time  end_time
0           1            1           1         5
1           2            1          15        23
2           3            2          10        12
3           4            2          17        28
4           5            2           2         8

In [98]:
Ads['customer_id'].values

array([1, 2, 2])

In [101]:
ads_tuples = zip(Ads['customer_id'].values,Ads['timestamp'].values)

In [102]:
conditions = [(Playback['customer_id'].values == customer_id) & (Playback['start_time'].values <= timestamp) & (Playback['end_time'].values >= timestamp) for customer_id, timestamp in ads_tuples]

In [103]:
conditions

[array([ True, False, False, False, False]),
 array([False, False, False,  True, False]),
 array([False, False, False,  True, False])]

In [107]:
import numpy as np
Playback['ad_id'] = np.piecewise(np.zeros(len(Playback)), conditions, Ads['ad_id'].values)

In [110]:
pd.DataFrame(Playback[Playback['ad_id']==0]['session_id'], columns=['session_id'])

   session_id
1           2
2           3
4           5

In [111]:
dic1142={"headers":{"Activity":["user_id","session_id","activity_date","activity_type"]},"rows":{"Activity":[[1,1,"2019-06-20","open_session"],[1,1,"2019-06-20","scroll_down"],[1,1,"2019-06-20","end_session"],[2,4,"2019-06-20","open_session"],[2,4,"2019-06-21","send_message"],[2,4,"2019-06-21","end_session"],[3,2,"2019-06-21","open_session"],[3,2,"2019-06-21","send_message"],[3,2,"2019-06-21","end_session"],[4,3,"2019-06-25","open_session"],[4,3,"2019-06-25","end_session"]]}}

In [161]:
dic1142= {"headers":{"Activity":["user_id","session_id","activity_date","activity_type"]},"rows":{"Activity":[[93,50,"2019-06-17","send_message"],[18,143,"2019-07-26","send_message"],[29,173,"2019-06-13","open_session"],[65,32,"2019-06-20","send_message"],[46,149,"2019-05-30","end_session"],[22,200,"2019-05-26","scroll_down"],[63,128,"2019-06-12","open_session"],[98,97,"2019-06-05","end_session"],[58,153,"2019-07-05","send_message"],[63,45,"2019-06-03","send_message"],[47,61,"2019-05-27","send_message"],[14,183,"2019-06-20","scroll_down"],[16,135,"2019-07-18","scroll_down"],[15,121,"2019-05-12","scroll_down"],[18,99,"2019-06-01","send_message"],[16,138,"2019-05-24","scroll_down"],[86,68,"2019-05-25","end_session"],[18,134,"2019-07-21","send_message"],[51,136,"2019-05-18","open_session"],[66,1,"2019-07-07","open_session"],[78,120,"2019-07-23","send_message"],[54,171,"2019-06-10","send_message"],[38,7,"2019-06-10","send_message"],[47,94,"2019-06-11","open_session"],[57,106,"2019-07-01","send_message"],[93,10,"2019-06-22","scroll_down"],[26,116,"2019-06-07","scroll_down"],[78,62,"2019-07-03","open_session"],[58,137,"2019-05-19","send_message"],[2,87,"2019-05-03","send_message"],[64,81,"2019-07-25","scroll_down"],[62,28,"2019-06-21","send_message"],[51,136,"2019-06-06","end_session"],[2,87,"2019-06-08","scroll_down"],[80,95,"2019-07-22","send_message"],[39,73,"2019-07-05","scroll_down"],[15,118,"2019-06-07","end_session"],[39,53,"2019-07-24","scroll_down"],[62,187,"2019-05-15","open_session"],[55,8,"2019-06-03","send_message"],[80,115,"2019-06-19","open_session"],[4,110,"2019-07-13","open_session"],[69,191,"2019-05-22","send_message"],[35,36,"2019-06-28","send_message"],[48,108,"2019-06-22","open_session"],[80,115,"2019-06-24","end_session"],[58,137,"2019-06-21","scroll_down"],[49,147,"2019-06-20","scroll_down"],[71,90,"2019-07-03","open_session"],[92,145,"2019-05-01","scroll_down"],[66,1,"2019-05-09","scroll_down"],[39,33,"2019-05-18","send_message"],[50,79,"2019-05-01","send_message"],[93,50,"2019-07-19","end_session"],[46,149,"2019-05-19","end_session"],[64,81,"2019-05-02","end_session"],[39,53,"2019-07-24","open_session"],[48,108,"2019-07-26","open_session"],[51,136,"2019-05-18","scroll_down"],[83,103,"2019-06-13","send_message"],[80,95,"2019-06-08","send_message"],[4,110,"2019-05-02","send_message"],[53,83,"2019-05-31","end_session"],[36,22,"2019-06-07","end_session"],[92,145,"2019-05-29","scroll_down"],[39,53,"2019-05-03","scroll_down"],[62,93,"2019-07-21","open_session"],[2,87,"2019-05-23","end_session"],[70,12,"2019-07-13","open_session"],[7,199,"2019-05-26","end_session"],[39,92,"2019-07-17","end_session"],[31,182,"2019-07-01","scroll_down"],[2,38,"2019-05-04","end_session"],[64,3,"2019-05-04","scroll_down"],[44,192,"2019-06-29","end_session"],[98,123,"2019-06-01","send_message"],[48,196,"2019-06-15","open_session"],[7,30,"2019-07-25","send_message"],[17,6,"2019-06-26","end_session"],[65,32,"2019-06-28","send_message"],[93,10,"2019-06-09","scroll_down"],[91,113,"2019-06-21","end_session"],[4,15,"2019-06-04","end_session"],[45,154,"2019-05-01","scroll_down"],[57,106,"2019-07-13","open_session"],[47,61,"2019-07-11","send_message"],[41,107,"2019-05-21","open_session"],[44,78,"2019-06-14","end_session"],[14,122,"2019-05-10","open_session"],[24,165,"2019-06-13","scroll_down"],[47,94,"2019-06-15","send_message"],[7,9,"2019-07-01","send_message"],[80,95,"2019-07-03","send_message"],[22,200,"2019-07-02","send_message"],[95,148,"2019-06-21","send_message"],[15,121,"2019-07-24","scroll_down"],[66,1,"2019-05-02","end_session"],[39,194,"2019-07-04","send_message"],[27,189,"2019-06-17","send_message"],[98,123,"2019-06-22","open_session"],[30,14,"2019-05-18","scroll_down"],[4,60,"2019-06-06","open_session"],[67,190,"2019-06-21","send_message"],[6,51,"2019-07-22","end_session"],[26,5,"2019-05-09","open_session"],[27,189,"2019-06-24","scroll_down"],[24,165,"2019-05-01","send_message"],[44,105,"2019-07-07","open_session"],[57,106,"2019-06-19","end_session"],[39,73,"2019-07-17","end_session"],[86,68,"2019-07-23","send_message"],[4,110,"2019-06-10","open_session"],[29,59,"2019-05-14","open_session"],[35,127,"2019-05-31","send_message"],[4,146,"2019-05-14","scroll_down"],[63,76,"2019-05-23","scroll_down"],[4,41,"2019-07-16","end_session"],[26,77,"2019-06-04","end_session"],[41,107,"2019-05-30","open_session"],[23,140,"2019-07-14","end_session"],[39,194,"2019-05-23","send_message"],[60,180,"2019-07-14","end_session"],[81,155,"2019-07-16","end_session"],[78,120,"2019-06-07","open_session"],[93,10,"2019-06-11","open_session"],[27,152,"2019-05-31","open_session"],[57,58,"2019-07-10","end_session"],[14,183,"2019-07-06","open_session"],[7,80,"2019-07-09","scroll_down"],[7,2,"2019-05-08","scroll_down"],[3,25,"2019-05-13","scroll_down"],[43,170,"2019-06-25","open_session"],[37,48,"2019-07-07","open_session"],[65,130,"2019-05-08","scroll_down"],[78,114,"2019-05-23","send_message"],[33,69,"2019-06-20","end_session"],[18,99,"2019-06-11","end_session"],[62,52,"2019-06-19","open_session"],[43,193,"2019-06-05","end_session"],[27,56,"2019-07-20","open_session"],[94,160,"2019-06-29","end_session"],[78,62,"2019-05-15","end_session"],[18,134,"2019-06-22","scroll_down"],[63,45,"2019-05-16","end_session"],[2,38,"2019-05-10","open_session"],[26,44,"2019-05-07","end_session"],[39,194,"2019-07-13","end_session"],[2,87,"2019-05-18","scroll_down"],[83,103,"2019-07-19","scroll_down"],[33,54,"2019-07-17","open_session"],[42,104,"2019-06-09","open_session"],[14,183,"2019-05-22","open_session"],[83,172,"2019-05-01","send_message"],[78,169,"2019-06-02","open_session"],[43,193,"2019-06-10","end_session"],[61,11,"2019-05-13","end_session"],[59,178,"2019-05-21","send_message"],[23,140,"2019-05-04","end_session"],[78,120,"2019-05-30","scroll_down"],[51,136,"2019-05-05","open_session"],[47,61,"2019-07-20","open_session"],[92,20,"2019-05-02","end_session"],[63,39,"2019-06-09","end_session"],[28,18,"2019-07-20","scroll_down"],[22,42,"2019-06-09","scroll_down"],[19,72,"2019-06-12","end_session"],[60,109,"2019-07-10","send_message"],[75,151,"2019-06-19","open_session"],[41,85,"2019-05-08","end_session"],[94,160,"2019-07-24","scroll_down"],[63,45,"2019-05-28","scroll_down"],[39,33,"2019-06-13","send_message"],[92,20,"2019-05-02","end_session"],[63,150,"2019-06-30","scroll_down"],[54,171,"2019-07-12","scroll_down"],[41,85,"2019-07-05","scroll_down"],[10,179,"2019-05-22","end_session"],[56,168,"2019-05-11","end_session"],[61,11,"2019-07-25","end_session"],[38,7,"2019-05-03","open_session"],[39,53,"2019-06-19","scroll_down"],[98,159,"2019-06-22","end_session"],[37,48,"2019-06-17","open_session"],[5,157,"2019-06-14","open_session"],[22,42,"2019-05-14","send_message"],[50,86,"2019-06-21","scroll_down"],[15,121,"2019-06-03","scroll_down"],[64,81,"2019-07-19","open_session"],[1,71,"2019-07-03","open_session"],[1,40,"2019-06-05","send_message"],[45,175,"2019-05-28","open_session"],[85,158,"2019-06-27","end_session"],[61,11,"2019-06-18","send_message"],[23,140,"2019-07-16","scroll_down"],[63,43,"2019-05-07","end_session"],[49,147,"2019-06-22","open_session"],[98,159,"2019-06-20","end_session"],[37,48,"2019-05-27","end_session"],[63,39,"2019-06-26","open_session"],[60,180,"2019-07-26","end_session"],[1,29,"2019-07-05","end_session"],[19,72,"2019-06-21","end_session"],[15,161,"2019-05-28","send_message"],[27,189,"2019-05-16","scroll_down"],[6,35,"2019-06-14","end_session"],[43,144,"2019-06-14","scroll_down"],[57,98,"2019-06-04","end_session"],[82,55,"2019-06-22","scroll_down"],[81,155,"2019-06-21","end_session"],[40,37,"2019-07-13","open_session"],[25,142,"2019-05-20","open_session"],[46,149,"2019-06-30","scroll_down"],[10,179,"2019-07-26","send_message"],[30,139,"2019-05-17","end_session"],[7,199,"2019-07-17","scroll_down"],[80,115,"2019-05-06","scroll_down"],[18,99,"2019-07-11","open_session"],[62,187,"2019-06-22","open_session"],[7,199,"2019-06-13","scroll_down"],[56,168,"2019-05-06","end_session"],[78,62,"2019-05-28","open_session"],[81,119,"2019-06-09","scroll_down"],[7,23,"2019-07-21","end_session"],[81,155,"2019-06-25","end_session"],[91,113,"2019-05-04","end_session"],[84,163,"2019-05-15","end_session"],[41,85,"2019-07-19","scroll_down"],[96,198,"2019-07-17","send_message"],[75,151,"2019-06-19","end_session"],[6,164,"2019-07-08","scroll_down"],[28,18,"2019-07-09","open_session"],[62,28,"2019-05-27","send_message"],[36,22,"2019-05-25","send_message"],[83,103,"2019-07-15","open_session"],[24,165,"2019-07-19","send_message"],[18,143,"2019-05-10","scroll_down"],[83,103,"2019-07-11","send_message"],[80,95,"2019-07-16","scroll_down"],[48,108,"2019-06-05","scroll_down"],[61,47,"2019-05-25","end_session"],[54,177,"2019-05-17","open_session"],[60,109,"2019-05-26","open_session"],[62,93,"2019-05-28","end_session"],[11,186,"2019-06-07","send_message"],[71,100,"2019-06-02","open_session"],[80,141,"2019-05-24","scroll_down"],[57,106,"2019-05-11","scroll_down"],[44,78,"2019-07-08","end_session"],[2,38,"2019-07-06","scroll_down"],[27,152,"2019-06-17","scroll_down"],[71,90,"2019-07-18","open_session"],[98,159,"2019-07-02","scroll_down"],[4,146,"2019-07-06","open_session"],[84,91,"2019-05-21","end_session"],[7,23,"2019-07-12","send_message"],[1,21,"2019-06-06","end_session"],[41,107,"2019-05-01","end_session"],[81,155,"2019-05-31","open_session"],[59,178,"2019-06-15","open_session"],[1,71,"2019-07-23","end_session"],[70,27,"2019-06-17","send_message"],[7,30,"2019-05-04","send_message"],[25,142,"2019-05-04","scroll_down"],[6,51,"2019-05-12","send_message"],[64,3,"2019-07-11","open_session"],[3,195,"2019-05-02","end_session"],[22,74,"2019-07-19","send_message"],[4,15,"2019-05-26","send_message"],[44,192,"2019-05-28","scroll_down"],[62,133,"2019-06-13","open_session"],[51,66,"2019-06-22","send_message"],[30,139,"2019-07-06","open_session"],[61,47,"2019-06-13","end_session"],[44,78,"2019-07-14","scroll_down"],[78,120,"2019-05-20","scroll_down"],[26,5,"2019-07-09","scroll_down"],[40,37,"2019-06-03","open_session"],[28,18,"2019-07-11","send_message"],[56,188,"2019-06-27","send_message"],[57,98,"2019-06-25","end_session"],[26,44,"2019-05-02","send_message"],[85,158,"2019-05-05","open_session"],[58,153,"2019-07-22","open_session"],[10,67,"2019-06-20","end_session"],[39,73,"2019-05-04","end_session"],[56,168,"2019-05-14","send_message"],[84,163,"2019-06-19","scroll_down"],[62,187,"2019-05-02","scroll_down"],[49,147,"2019-06-07","send_message"],[45,175,"2019-06-18","send_message"],[41,85,"2019-07-22","send_message"],[28,174,"2019-06-23","scroll_down"],[53,184,"2019-06-08","open_session"],[81,119,"2019-07-22","open_session"],[7,9,"2019-05-15","scroll_down"],[10,179,"2019-05-29","send_message"],[18,134,"2019-05-30","end_session"],[25,167,"2019-07-18","scroll_down"],[39,53,"2019-05-15","send_message"],[25,167,"2019-07-22","send_message"],[75,151,"2019-07-13","end_session"],[97,13,"2019-06-03","open_session"],[58,153,"2019-07-26","end_session"],[33,54,"2019-05-26","send_message"],[41,107,"2019-06-01","send_message"],[84,91,"2019-05-19","scroll_down"],[53,83,"2019-05-22","send_message"],[55,8,"2019-07-16","send_message"],[37,57,"2019-07-05","open_session"],[44,192,"2019-05-21","open_session"],[30,139,"2019-06-03","send_message"],[66,124,"2019-07-01","scroll_down"],[6,51,"2019-06-15","scroll_down"],[80,95,"2019-07-16","open_session"],[39,33,"2019-05-19","end_session"],[71,102,"2019-07-18","open_session"],[54,171,"2019-06-27","send_message"],[4,146,"2019-07-16","end_session"],[60,109,"2019-07-25","end_session"],[65,32,"2019-06-03","send_message"],[81,119,"2019-05-20","end_session"],[63,128,"2019-05-13","send_message"],[62,187,"2019-06-02","end_session"],[39,73,"2019-05-25","end_session"],[60,109,"2019-06-14","send_message"],[78,197,"2019-07-18","send_message"],[50,86,"2019-07-22","send_message"],[65,130,"2019-06-26","open_session"],[45,175,"2019-05-24","open_session"],[31,182,"2019-06-13","open_session"],[14,122,"2019-07-07","open_session"],[63,43,"2019-07-03","scroll_down"],[7,80,"2019-05-14","end_session"],[93,49,"2019-06-08","send_message"],[1,21,"2019-07-17","send_message"],[6,51,"2019-07-21","send_message"],[98,159,"2019-06-27","end_session"],[51,136,"2019-05-25","scroll_down"],[80,95,"2019-07-02","open_session"],[47,94,"2019-05-09","scroll_down"],[44,84,"2019-07-20","end_session"],[34,46,"2019-07-03","open_session"],[51,136,"2019-07-03","end_session"],[85,158,"2019-06-17","open_session"],[7,2,"2019-06-28","end_session"],[97,13,"2019-05-31","scroll_down"],[61,47,"2019-06-11","scroll_down"],[25,131,"2019-07-06","end_session"],[39,73,"2019-06-24","end_session"],[98,123,"2019-05-09","scroll_down"],[71,102,"2019-06-19","end_session"],[41,185,"2019-07-04","end_session"],[98,159,"2019-07-14","open_session"],[54,177,"2019-07-14","end_session"],[10,67,"2019-07-08","end_session"],[1,29,"2019-07-16","send_message"],[98,181,"2019-05-25","send_message"],[88,88,"2019-07-16","scroll_down"],[45,154,"2019-07-11","send_message"],[84,163,"2019-06-05","scroll_down"],[7,23,"2019-07-18","scroll_down"],[66,1,"2019-06-27","scroll_down"],[25,131,"2019-05-07","end_session"],[62,187,"2019-05-01","scroll_down"],[62,93,"2019-06-04","open_session"],[71,100,"2019-06-15","end_session"],[63,150,"2019-06-03","send_message"],[66,1,"2019-06-20","scroll_down"],[28,166,"2019-07-19","scroll_down"],[63,76,"2019-05-12","open_session"],[4,110,"2019-05-15","end_session"],[62,133,"2019-05-30","end_session"],[98,97,"2019-07-21","scroll_down"],[60,109,"2019-06-22","open_session"],[69,191,"2019-05-08","open_session"],[65,32,"2019-07-24","open_session"],[27,189,"2019-05-04","send_message"],[7,30,"2019-06-27","send_message"],[75,151,"2019-07-07","open_session"],[96,198,"2019-07-01","send_message"],[92,20,"2019-07-21","scroll_down"],[18,143,"2019-06-09","end_session"],[36,22,"2019-05-23","scroll_down"],[44,84,"2019-05-02","end_session"],[98,123,"2019-05-23","scroll_down"],[7,199,"2019-05-22","open_session"],[62,132,"2019-05-09","send_message"],[26,4,"2019-07-10","send_message"],[23,140,"2019-05-06","open_session"],[40,37,"2019-07-18","open_session"],[78,65,"2019-06-10","open_session"],[28,166,"2019-07-19","open_session"],[63,43,"2019-05-25","end_session"],[10,67,"2019-06-26","end_session"],[51,136,"2019-05-15","scroll_down"],[25,131,"2019-05-11","send_message"],[65,32,"2019-05-13","end_session"],[28,18,"2019-06-20","end_session"],[48,16,"2019-06-16","open_session"],[89,82,"2019-06-25","scroll_down"],[70,12,"2019-05-10","scroll_down"],[44,84,"2019-05-15","open_session"],[83,172,"2019-06-19","end_session"],[39,73,"2019-06-05","send_message"],[59,178,"2019-06-09","send_message"],[51,66,"2019-05-08","end_session"],[66,1,"2019-06-19","open_session"],[4,41,"2019-05-12","end_session"],[96,198,"2019-05-20","end_session"],[66,1,"2019-06-07","send_message"],[38,96,"2019-05-21","scroll_down"],[63,76,"2019-06-29","scroll_down"],[3,25,"2019-05-15","open_session"],[61,11,"2019-06-24","scroll_down"],[30,101,"2019-06-04","send_message"],[81,155,"2019-06-26","open_session"],[62,52,"2019-06-19","end_session"],[30,139,"2019-06-15","end_session"],[84,163,"2019-06-22","end_session"],[44,78,"2019-06-13","open_session"],[35,36,"2019-05-16","scroll_down"],[78,114,"2019-07-02","send_message"],[51,136,"2019-06-19","open_session"],[33,69,"2019-07-22","open_session"],[4,60,"2019-06-23","open_session"],[24,165,"2019-07-18","open_session"],[50,86,"2019-05-03","end_session"],[54,31,"2019-05-20","end_session"],[64,126,"2019-06-23","scroll_down"],[28,174,"2019-07-09","open_session"],[44,192,"2019-05-25","open_session"],[63,76,"2019-05-12","end_session"],[6,35,"2019-07-08","scroll_down"],[88,88,"2019-07-25","open_session"],[62,93,"2019-07-08","end_session"],[44,192,"2019-07-05","end_session"],[1,40,"2019-06-04","end_session"],[15,121,"2019-07-06","send_message"],[78,114,"2019-06-26","end_session"],[93,10,"2019-05-16","open_session"],[7,80,"2019-05-19","send_message"],[66,112,"2019-06-05","open_session"],[96,198,"2019-05-08","send_message"],[38,96,"2019-07-05","open_session"],[69,191,"2019-05-26","send_message"],[43,193,"2019-06-12","end_session"],[64,126,"2019-05-25","scroll_down"],[38,7,"2019-05-27","send_message"],[4,60,"2019-06-20","scroll_down"],[16,138,"2019-06-13","end_session"],[27,189,"2019-05-08","scroll_down"],[84,70,"2019-06-19","scroll_down"],[88,88,"2019-06-22","scroll_down"],[55,8,"2019-05-25","scroll_down"],[27,56,"2019-06-21","scroll_down"],[66,112,"2019-07-07","send_message"],[31,182,"2019-05-05","open_session"],[44,63,"2019-05-20","scroll_down"],[1,40,"2019-05-08","end_session"],[56,168,"2019-07-23","end_session"],[98,97,"2019-07-21","scroll_down"],[81,155,"2019-07-14","open_session"],[95,148,"2019-05-11","end_session"],[66,124,"2019-05-04","scroll_down"],[63,128,"2019-06-11","end_session"],[86,68,"2019-05-12","scroll_down"],[25,131,"2019-05-04","end_session"],[63,45,"2019-06-01","end_session"],[38,96,"2019-06-23","open_session"],[6,51,"2019-07-11","open_session"],[54,171,"2019-05-07","scroll_down"],[7,2,"2019-07-12","open_session"],[50,79,"2019-07-13","scroll_down"],[71,90,"2019-05-18","send_message"],[6,51,"2019-07-23","end_session"],[48,16,"2019-05-29","end_session"],[69,111,"2019-06-08","send_message"],[62,52,"2019-05-11","send_message"],[30,14,"2019-05-29","end_session"],[98,159,"2019-05-20","open_session"],[7,199,"2019-06-13","send_message"],[30,139,"2019-07-05","scroll_down"],[55,117,"2019-07-14","scroll_down"],[29,173,"2019-06-07","scroll_down"],[98,159,"2019-07-08","send_message"],[80,141,"2019-05-05","end_session"],[39,73,"2019-07-11","send_message"],[26,5,"2019-06-07","send_message"],[65,130,"2019-05-12","send_message"],[41,185,"2019-05-16","send_message"],[62,187,"2019-07-04","open_session"],[7,23,"2019-06-28","end_session"],[51,136,"2019-07-23","end_session"],[29,59,"2019-07-07","end_session"],[58,153,"2019-07-06","scroll_down"],[84,91,"2019-06-05","send_message"],[10,67,"2019-05-18","send_message"],[83,172,"2019-07-13","end_session"],[78,65,"2019-05-13","open_session"],[29,59,"2019-05-29","scroll_down"]]}}

In [162]:
newlist = list(dic1142.values())[1].values()

In [163]:
Activity = pd.DataFrame([item for items in newlist for item in items], columns = ["user_id","session_id","activity_date","activity_type"])

In [164]:
Activity

     user_id  session_id activity_date activity_type
0         93          50    2019-06-17  send_message
1         18         143    2019-07-26  send_message
2         29         173    2019-06-13  open_session
3         65          32    2019-06-20  send_message
4         46         149    2019-05-30   end_session
..       ...         ...           ...           ...
495       84          91    2019-06-05  send_message
496       10          67    2019-05-18  send_message
497       83         172    2019-07-13   end_session
498       78          65    2019-05-13  open_session
499       29          59    2019-05-29   scroll_down

[500 rows x 4 columns]

In [134]:
Activity['start_day'] = pd.to_datetime('2019-07-27')+pd.DateOffset(days=-29)

In [132]:
Activity['end_day'] = pd.to_datetime('2019-07-27')

In [165]:
sub= Activity[(Activity['activity_date']>='2019-06-28') & (Activity['activity_date']<='2019-07-27')].agg({'session_id':'nunique','user_id':'nunique' }).reset_index()

In [166]:
sub.shape

(2, 2)

In [167]:
sub

        index    0
0  session_id  108
1     user_id   61

In [149]:
sub['name']=sub.index

In [170]:
round(np.nan_to_num((sub.iloc[0,1]/sub.iloc[1,1])),2)

1.77

# 1875

In [171]:
dic1875 = {"headers":{"Employees":["employee_id","name","salary"]},"rows":{"Employees":[[2,"Meir",3000],[3,"Michael",3000],[7,"Addilyn",7400],[8,"Juan",6100],[9,"Kannon",7400]]}}

In [178]:
newlist = list(list(dic1875.values())[1].values())

In [179]:
employees = pd.DataFrame([item for items in newlist for item in items],columns = ["employee_id","name","salary"])

In [180]:
employees

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3000
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7400

In [196]:
sub = pd.DataFrame(employees.groupby('salary')['salary'].count())

In [199]:
sub.columns=['cnt']

In [202]:
sub.reset_index(inplace=True)

In [204]:
list(sub[sub['cnt']>1]['salary'])

0    3000
2    7400
Name: salary, dtype: int64

In [184]:
employees['salary'].rank(method ='dense', ascending=True)

0    1.0
1    1.0
2    3.0
3    2.0
4    3.0
Name: salary, dtype: float64

In [207]:
sub_emp = employees[employees['salary'].isin(list(sub[sub['cnt']>1]['salary']))]

In [209]:
sub_emp['team_id'] = sub_emp['salary'].rank(method ='dense', ascending=True)

/Users/wentinggao/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [210]:
sub_emp

   employee_id     name  salary  team_id
0            2     Meir    3000      1.0
1            3  Michael    3000      1.0
2            7  Addilyn    7400      2.0
4            9   Kannon    7400      2.0

# 1934

In [16]:
import pandas as pd
import numpy as np
Signups = pd.DataFrame([[3, "2020-03-21 10:16:13"], 
[7, "2020-01-04 13:57:59"], [2, "2020-07-29 23:09:44"], 
[6, "2020-12-09 10:39:37"]], columns =['user_id','time_stamp'])

print(Signups)

   user_id           time_stamp
0        3  2020-03-21 10:16:13
1        7  2020-01-04 13:57:59
2        2  2020-07-29 23:09:44
3        6  2020-12-09 10:39:37

In [6]:
Confirmations = pd.DataFrame([[3, "2021-01-06 03:30:46", "timeout"], [3, "2021-07-14 14:00:00", "timeout"], 
[7, "2021-06-12 11:57:29", "confirmed"], [7, "2021-06-13 12:58:28", "confirmed"], 
[7, "2021-06-14 13:59:27", "confirmed"], [2, "2021-01-22 00:00:00", "confirmed"], [2, "2021-02-28 23:59:59", "timeout"]],
                            columns =['user_id', 'timestamp', 'action'])
print(Confirmations)

   user_id            timestamp     action
0        3  2021-01-06 03:30:46    timeout
1        3  2021-07-14 14:00:00    timeout
2        7  2021-06-12 11:57:29  confirmed
3        7  2021-06-13 12:58:28  confirmed
4        7  2021-06-14 13:59:27  confirmed
5        2  2021-01-22 00:00:00  confirmed
6        2  2021-02-28 23:59:59    timeout

In [19]:
#df1 = Signups.merge(Confirmations, how ='left', on ='user_id')

Confirm1 = Confirmations.groupby(['user_id'])['action'].count().reset_index()
Confirm1.columns = ['user_id', 'den']

Confirm2 = Confirmations[Confirmations['action']=='confirmed'].groupby(['user_id'])['action'].count().reset_index()
Confirm2.columns = ['user_id', 'num']

df1 = Signups.merge(Confirm1, how ='left', on ='user_id').merge(Confirm2, how ='left', on ='user_id')

df1['Confirmation_rate'] = (df1['num']/df1['den'])

df1['Confirmation_rate'].replace(np.NaN, 0, inplace= True)

print(df1[['user_id','Confirmation_rate']])

   user_id  Confirmation_rate
0        3                0.0
1        7                1.0
2        2                0.5
3        6                0.0

# 1341 Movie Rating

In [25]:
Movies=pd.DataFrame([[1, "Avengers"], [2, "Frozen 2"], [3, "Joker"]], columns =['movie_id','title'])
Users = pd.DataFrame([[1, "Daniel"], [2, "Monica"], [3, "Maria"], [4, "James"]], columns =['user_id', 'name'])
Movie_Rating = pd.DataFrame([[1, 1, 3, "2020-01-12"], [1, 2, 4, "2020-02-11"], [1, 3, 2, "2020-02-12"], 
[1, 4, 1, "2020-01-01"], [2, 1, 5, "2020-02-17"], [2, 2, 2, "2020-02-01"], [2, 3, 2, "2020-03-01"], [3, 1, 3, "2020-02-22"], [3, 2, 4, "2020-02-25"]], 
                           columns=['movie_id','user_id','rating','created_at'])

In [72]:
df1 = Movie_Rating.groupby(['user_id'])['movie_id'].count().reset_index()
df1.columns = ['user_id', 'cnt']
df1.sort_values(by=['cnt','user_id'], ascending=[False, True],inplace=True)

df2=Movie_Rating[(Movie_Rating['created_at']>='2020-02-01')&(Movie_Rating['created_at']<='2020-02-29')]\
.groupby(['movie_id'])['rating'].mean().reset_index()
df2.columns=['movie_id','rate']
df2.sort_values(by=['rate','movie_id'], ascending=[False, True],inplace=True)

Users.columns =['user_id','results']
Movies.columns = ['movie_id', 'results']
test1 = df1.merge(Users, how='inner', on = 'user_id')

test1.sort_values(by=['cnt','results'], ascending=[False, True],inplace=True)

test2 = df2.merge(Movies, how='inner', on = 'movie_id')
test2.sort_values(by=['rate','results'], ascending=[False, True],inplace=True)

pd.DataFrame([test1.iloc[0]['results'],test2.iloc[0]['results']], columns=['results'])

    results
0    Daniel
1  Frozen 2

# 1729.Find Followers Count

In [78]:
Followers=pd.DataFrame([["0","1"],["1","0"],["2","0"],["2","1"]], columns=['user_id','follower_id'])

In [79]:
df1 = Followers.groupby(['user_id'])['follower_id'].nunique().reset_index(name='followers_count').sort_values(by='user_id', ascending=True)
#df1.columns =['user_id','followers_count']
#df1.sort_values(by='user_id', ascending=True)
print(df1)

  user_id  followers_count
0       0                1
1       1                1
2       2                2

# 1050. Actors and Directors Who Cooperated At Least Three Times

In [80]:
ActorDirector = pd.DataFrame([[1,1,0],[1,1,1],[1,1,2],[1,2,3],[1,2,4],[2,1,5],[2,1,6]], columns =['actor_id','director_id','timestamp'])

In [90]:
# method 1
ActorDirector.groupby(['actor_id','director_id'])['timestamp'].count().reset_index(name='cnt')
df[df['cnt']>=3][['actor_id', 'director_id']]

   actor_id  director_id
0         1            1

In [91]:
# method2
ActorDirector.groupby(['actor_id','director_id']).filter(lambda x: x['timestamp'].count()>=3)\
[['actor_id','director_id']].drop_duplicates()

   actor_id  director_id
0         1            1

# 1075. Project Employees I

In [94]:
Project=pd.DataFrame([[1,1],[1,2],[1,3],[2,1],[2,4]], columns=['project_id','employee_id'])
Employee = pd.DataFrame([[1,"Khaled",3],[2,"Ali",2],[3,"John",1],[4,"Doe",2]], \
                        columns=['employee_id', 'name', 'experience_years'])

In [95]:
# option 1
df = Employee.merge(Project, how='left', on='employee_id')
df.groupby(['project_id'])['experience_years'].mean().reset_index(name='average_years').round(2)

   project_id  average_years
0           1            2.0
1           2            2.5

In [97]:
# option 2
Employee.merge(Project, how='left', on='employee_id').groupby(['project_id']) \
['experience_years'].mean().reset_index(name='average_years').round(2)

   project_id  average_years
0           1            2.0
1           2            2.5

# 1076. Project Employees II

In [112]:
Employee.merge(Project, how='left', on='employee_id').groupby(['project_id']) \
['employee_id'].count().reset_index(name='cnt').idxmax()['project_id']

1

# 1077. Project Employees III

In [127]:
Project=pd.DataFrame([[1,1],[1,2],[1,3],[2,1],[2,4]], columns=['project_id','employee_id'])
Employee = pd.DataFrame([[1,"Khaled",3],[2,"Ali",2],[3,"John",3],[4,"Doe",2]], \
                        columns=['employee_id', 'name', 'experience_years'])

In [128]:
df = Employee.merge(Project, how='inner', on='employee_id')
df['rank']= df.groupby(['project_id'])['experience_years'].\
rank(method='dense', ascending=False)
df[df['rank']==1][['project_id', 'employee_id']]

   project_id  employee_id
0           1            1
1           2            1
3           1            3

# 579. Find Cumulative Salary of an Employee

In [129]:
Employee=pd.DataFrame([[1,1,20],[2,1,20],[1,2,30],[2,2,30],[3,2,40],[1,3,40],[3,3,60],[1,4,60],[3,4,70]], \
                      columns=['Id','Month','Salary'])

In [195]:
Employee['rank']=Employee.groupby('Id')['Month'].rank('dense', ascending=False)
df = Employee[Employee['rank']>1].sort_values(by=['Id','Month'],ascending=[True,True])
cum = df.groupby('Id').rolling(window=3,min_periods=1)['Salary'].sum().reset_index()['Salary']
df['Cum']=list(cum)
df[['Id','Month', "Cum"]].sort_values(by=['Id','Month'], ascending=[True, False])

   Id  Month    Cum
5   1      3   90.0
2   1      2   50.0
0   1      1   20.0
1   2      1   20.0
6   3      3  100.0
4   3      2   40.0

# 1715. Count Apples and Oranges

## 2021-07-19

In [201]:
Boxes = pd.DataFrame([[2," ",6,15],[18,14,4,15],[19,3,8,4],[12,2,19,20],[20,6,12,9],[8,6,9,9],[3,14,16,7]],\
                     columns = ['box_id','chest_id','apple_count','orange_count'])

Chests = pd.DataFrame([[6,5,6],[14,20,10],[2,8,8],[3,19,4],[16,19,19]],\
                      columns=['chest_id','apple_count','orange_count'])

In [203]:
Chests.columns =['chest_id','apple','orange']
df = Boxes.merge(Chests, on='chest_id',how='left')
df['apple']=df['apple'].fillna(0)
df['orange'] = df['orange'].fillna(0)

df['orange_count1']=df['orange']+df['orange_count']
df['apple_count1']=df['apple']+df['apple_count']

df[['apple_count1','orange_count1']].sum(axis=0)

apple_count1     151.0
orange_count1    123.0
dtype: float64

# 1661. Average Time of Process per Machine

In [204]:
Activity=pd.DataFrame([[0,0,"start",0.712],[0,0,"end",1.52],\
[0,1,"start",3.14],[0,1,"end",4.12],[1,0,"start",0.55],[1,0,"end",1.55],[1,1,"start",0.43],\
[1,1,"end",1.42],[2,0,"start",4.1],[2,0,"end",4.512],[2,1,"start",2.5],[2,1,"end",5]],\
                     columns=['machine_id','process_id','activity_type','timestamp'])

In [207]:
df = Activity[Activity['activity_type']=='start'].merge(Activity[Activity['activity_type']=='end'],how='inner',\
                                                   on=['machine_id','process_id'])

df['dif'] = df['timestamp_y']-df['timestamp_x']

df.groupby(['machine_id'])['dif'].mean().reset_index(name='processing_time').round(3)

   machine_id  processing_time
0           0            0.894
1           1            0.995
2           2            1.456

In [206]:
df

,machine_id,process_id,activity_type_x,timestamp_x,activity_type_y,timestamp_y
0,0,0,start,0.712,end,1.520
1,0,1,start,3.140,end,4.120
2,1,0,start,0.550,end,1.550
3,1,1,start,0.430,end,1.420
4,2,0,start,4.100,end,4.512
5,2,1,start,2.500,end,5.000

# 1607. Sellers With No Sales

In [209]:
Orders = pd.DataFrame([[1, "2020-03-01", 1500, 101, 1], [2, "2020-05-25", 2400, 102, 2],\
                       [3, "2019-05-25", 800, 101, 3], [4, "2020-09-13", 1000, 103, 2],\
 [5, "2019-02-11", 700, 101, 2]], columns =['order_id', 'sale_date','order_cost', 'customer_id','seller_id'])


Seller = pd.DataFrame([[1, "Daniel"], [2, "Elizabeth"], [3, "Frank"]], columns=['seller_id','seller_name'])

In [211]:
Orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
order_id       5 non-null int64
sale_date      5 non-null object
order_cost     5 non-null int64
customer_id    5 non-null int64
seller_id      5 non-null int64
dtypes: int64(4), object(1)
memory usage: 328.0+ bytes

In [212]:
Orders['sale_date'] = pd.to_datetime(Orders['sale_date'])

In [214]:
pd.Series(Seller[~Seller['seller_id'].isin(list(Orders[Orders['sale_date'].dt.year==2020]['seller_id']))]\
['seller_name'].unique()).sort_values()

0    Frank
dtype: object

# 1581. Customer Who Visited but Did Not Make Any Transactions

In [224]:
Visits = pd.DataFrame([[1,23],[2,9],[4,30],[5,54],[6,96],[7,54],[8,54]], columns =['visit_id','customer_id'])
Transactions = pd.DataFrame([[2,5,310],[3,5,300],[9,5,200],[12,1,910],[13,2,970]],\
                           columns =['transaction_id','visit_id','amount'])

In [228]:
df = Visits.merge(Transactions, how = 'left', on='visit_id')
df

   visit_id  customer_id  transaction_id  amount
0         1           23            12.0   910.0
1         2            9            13.0   970.0
2         4           30             NaN     NaN
3         5           54             2.0   310.0
4         5           54             3.0   300.0
5         5           54             9.0   200.0
6         6           96             NaN     NaN
7         7           54             NaN     NaN
8         8           54             NaN     NaN

In [232]:
df = pd.DataFrame(Visits.merge(Transactions, how = 'left', on='visit_id'))
df1 = df[df['transaction_id'].isnull()==True]             
df1.groupby('customer_id')['visit_id'].count().reset_index(name='count_no_trans').sort_values(by='customer_id')

   customer_id  count_no_trans
0           30               1
1           54               2
2           96               1

# 1532. The Most Recent Three Orders

In [233]:
Customers = pd.DataFrame([[1,"Winston"],[2,"Jonathan"],[3,"Annabelle"],[4,"Marwan"],[5,"Khaled"]],\
                        columns =['customer_id','name'])

Orders = pd.DataFrame([[1,"2020-07-31",1,30],[2,"2020-7-30",2,40],[3,"2020-07-31",3,70],\
                       [4,"2020-07-29",4,100],[5,"2020-06-10",1,1010],[6,"2020-08-01",2,102],\
[7,"2020-08-01",3,111],[8,"2020-08-03",1,99],[9,"2020-08-07",2,32],[10,"2020-07-15",1,2]],\
                    columns = ['order_id','order_date','customer_id','cost'] )

In [239]:
Orders['order_date']=pd.to_datetime(Orders['order_date'])

In [241]:
Orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
order_id       10 non-null int64
order_date     10 non-null datetime64[ns]
customer_id    10 non-null int64
cost           10 non-null int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 448.0 bytes

In [246]:
df

   order_id order_date  customer_id  cost       name  rnk
0         1 2020-07-31            1    30    Winston  3.0
1         2 2020-07-30            2    40   Jonathan  1.0
2         3 2020-07-31            3    70  Annabelle  1.0
3         4 2020-07-29            4   100     Marwan  1.0
4         5 2020-06-10            1  1010    Winston  1.0
5         6 2020-08-01            2   102   Jonathan  2.0
6         7 2020-08-01            3   111  Annabelle  2.0
7         8 2020-08-03            1    99    Winston  4.0
8         9 2020-08-07            2    32   Jonathan  3.0
9        10 2020-07-15            1     2    Winston  2.0

In [248]:
df = Orders.merge(Customers, how='left', on='customer_id')
df['rnk'] = df.groupby(['customer_id'])['order_date'].rank(method='dense', ascending=False)
df[df['rnk']<=3][['name','customer_id','order_id','order_date']].\
sort_values(by=['name','customer_id','order_date'], ascending=[True, True, False])

        name  customer_id  order_id order_date
6  Annabelle            3         7 2020-08-01
2  Annabelle            3         3 2020-07-31
8   Jonathan            2         9 2020-08-07
5   Jonathan            2         6 2020-08-01
1   Jonathan            2         2 2020-07-30
3     Marwan            4         4 2020-07-29
7    Winston            1         8 2020-08-03
0    Winston            1         1 2020-07-31
9    Winston            1        10 2020-07-15

In [229]:
df[df['transaction_id'].isnull() ==True]

   visit_id  customer_id  transaction_id  amount
2         4           30             NaN     NaN
6         6           96             NaN     NaN
7         7           54             NaN     NaN
8         8           54             NaN     NaN

# 178. Rank Scores 2021/7/21

In [249]:
Scores=pd.DataFrame([[1, 3.50], [2, 3.65], [3, 4.00], [4, 3.85], [5, 4.00], [6, 3.65]], columns=['Id','score'])

In [251]:
Scores.rank(method='dense',ascending=True)

    Id  score
0  1.0    1.0
1  2.0    2.0
2  3.0    4.0
3  4.0    3.0
4  5.0    4.0
5  6.0    2.0

In [257]:
Scores['rank']=Scores['score'].rank(method='dense',ascending=True)
Scores.sort_values(by=['rank'],ascending=False, inplace=True)
Scores[['score','rank']]

   score  rank
2   4.00   4.0
4   4.00   4.0
3   3.85   3.0
1   3.65   2.0
5   3.65   2.0
0   3.50   1.0

# 1709. Biggest Window Between Visits

In [263]:
UserVisits=pd.DataFrame([["1","2020-11-28"],["1","2020-10-20"],["1","2020-12-3"],["2","2020-10-5"],["2","2020-12-9"],["3","2020-11-11"]]\
            , columns =['user_id','visit_date'])

In [287]:
UserVisits['visit_date']=pd.to_datetime(UserVisits['visit_date'])
UserVisits['lag_dt'] = UserVisits.groupby('user_id')['visit_date'].shift(-1)

import datetime
UserVisits['lag_dt'] = UserVisits['lag_dt'].fillna(datetime.datetime(2021,1,1))
UserVisits['Biggest_window'] = (UserVisits['lag_dt']-UserVisits['visit_date'])
UserVisits.groupby(['user_id'])['Biggest_window'].max().reset_index().sort_values('user_id')

  user_id Biggest_window
0       1        44 days
1       2        65 days
2       3        51 days

# 1421. NPV Queries

In [291]:
Queries= pd.DataFrame([[1,2019],[2,2008],[3,2009],[7,2018],[7,2019],[7,2020],[13,2019]],\
                    columns=['id','year'])
NPV=pd.DataFrame([[1,2018,100],[7,2020,30],[13,2019,40],[1,2019,113],[2,2008,121],[3,2009,21],[11,2020,99],[7,2019,0]],\
                columns=['id','year','npv'])

In [292]:
df=Queries.merge(NPV, on=['id','year'],how='left')
df['npv'].fillna(0,inplace=True)
df

   id  year    npv
0   1  2019  113.0
1   2  2008  121.0
2   3  2009   21.0
3   7  2018    0.0
4   7  2019    0.0
5   7  2020   30.0
6  13  2019   40.0

# 1777. Product's Price for Each Store

In [29]:
# be careful of column format
Products=pd.DataFrame([["0","store1",95],["0","store3",105],["0","store2",100],["1","store1",70],["1","store3",80]],\
                     columns=['product_id','store','price'])

In [30]:
Products

  product_id   store  price
0          0  store1     95
1          0  store3    105
2          0  store2    100
3          1  store1     70
4          1  store3     80

In [31]:
import numpy as np
pd.Series(np.where(Products['store']=='store1', Products['price'],0))

0    95
1     0
2     0
3    70
4     0
dtype: int64

In [32]:
# long to wide
Products.pivot(index='product_id',columns = 'store')['price'].reset_index()

store product_id  store1  store2  store3
0              0    95.0   100.0   105.0
1              1    70.0     NaN    80.0

In [33]:
np.where(Products['store']=='store1', Products['price'],0)

array([95,  0,  0, 70,  0])

In [35]:
##? where's wrong
Products['store1']=pd.Series(np.where(Products['store']=='store1', Products['price'],np.nan))
Products['store2']=pd.Series(np.where(Products['store']=='store2', Products['price'],np.nan))
Products['store3']=pd.Series(np.where(Products['store']=='store3', Products['price'],np.nan))
Products.groupby(['product_id'])[['store1','store2','store3']].max().reset_index()

  product_id  store1  store2  store3
0          0    95.0   100.0   105.0
1          1    70.0     NaN    80.0

In [36]:
Products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
product_id    5 non-null object
store         5 non-null object
price         5 non-null int64
store1        2 non-null float64
store2        1 non-null float64
store3        2 non-null float64
dtypes: float64(3), int64(1), object(2)
memory usage: 368.0+ bytes

# 1795. Rearrange Products Table

In [356]:
Products1 = Products.pivot(index='product_id',columns = 'store')['price'].reset_index()

In [357]:
Products1

store product_id store1 store2 store3
0              0     95    100    105
1              1     70    NaN     80

In [358]:
# wide to long
Products1.melt(id_vars='product_id').rename(columns={'product_id':'product_id','store':"store",'value':'price'})

  product_id   store price
0          0  store1    95
1          1  store1    70
2          0  store2   100
3          1  store2   NaN
4          0  store3   105
5          1  store3    80

In [ ]:
long to wide other methods....

# 185. Department Top Three Salaries 2021/7/24

In [1]:
import pandas as pd
Employee=pd.DataFrame([[1, "Joe", 85000, 1], [2, "Henry", 80000, 2], [3, "Sam", 60000, 2], [4, "Max", 90000, 1],\
[5, "Janet", 69000, 1],[6, "Randy", 85000, 1], [7, "Will", 70000, 1]],
                     columns =['Id','Name','Salary','DepartmentId'])

Department=pd.DataFrame([[1, "IT"], [2, "Sales"]], columns =['Id','Name'])

In [12]:
Employee['rank'] = Employee.groupby(['DepartmentId'])['Salary'].rank(method='dense', ascending=False)
Department.columns =['DepartmentId','Department']
df1=Employee.merge(Department, how ='left', on ='DepartmentId')

# be careful of column order after merge
df1.columns=['Id','Employee','Salary','DeparmenetId','rank','Department']
df1[df1['rank']<=3][['Department','Employee','Salary']].sort_values('Salary', ascending=False)

  Department Employee  Salary
3         IT      Max   90000
0         IT      Joe   85000
5         IT    Randy   85000
1      Sales    Henry   80000
6         IT     Will   70000
2      Sales      Sam   60000

# 570. Managers with at Least 5 Direct Reports

In [16]:
Employee = pd.DataFrame([[101, "John", "A", ],[102, "Dan", "A", 101], [103, "James", "A", 101],\
           [104, "Amy", "A", 101], [105, "Anne", "A", 101], [106, "Ron", "B", 101]],
                       columns = ["Id", "Name", "Department", "ManagerId"])

In [17]:
cnt = Employee.groupby(['ManagerId'])['ManagerId'].count().reset_index(name='count')
Employee[Employee['Id'].isin(list(cnt[cnt['count']>=5]['ManagerId']))]['Name']

0    John
Name: Name, dtype: object

# 1212. Team Scores in Football Tournament

In [52]:
Teams=pd.DataFrame([[10, "Leetcode FC"], [20, "NewYork FC"], [30, "Atlanta FC"], [40, "Chicago FC"], [50, "Toronto FC"]],\
                  columns=["team_id", "team_name"])
Matches = pd.DataFrame([[1, 10, 20, 3, 0], [2, 30, 10, 2, 2], [3, 10, 50, 5, 1], [4, 20, 30, 1, 0], [5, 50, 30, 1, 0]],\
                    columns = ["match_id", "host_team", "guest_team", "host_goals", "guest_goals"]
                      
                      )

In [50]:
## method 1: write for loop to add points
pt = []
for index, row in Matches.iterrows():
    if row['host_goals']>row['guest_goals']:
        pt.append(3)
    elif row['host_goals']==row['guest_goals']:
        pt.append(1)
    else:
        pt.append(0)
    
Matches['num_points']=pt

In [62]:
# method 3: write a function
def func(row):
    if row['host_goals']>row['guest_goals']:
        return 3
    elif row['host_goals']<row['guest_goals']:
        return 0
    else:
        return 1
Matches.apply(func, axis=1)

0    3
1    1
2    3
3    3
4    3
dtype: int64

In [60]:
# method 3: optimal np.where
Matches['host_num_points']=np.where(Matches['host_goals']>Matches['guest_goals'],3,\
                               np.where(Matches['host_goals']<Matches['guest_goals'],0,1))

Matches['guest_num_points']=np.where(Matches['host_goals']>Matches['guest_goals'],0,\
                               np.where(Matches['host_goals']<Matches['guest_goals'],3,1))

t1 = Matches[['host_team','host_num_points']].rename(columns={'host_team':'team_id','host_num_points':"num_points"})

t2 = Matches[['guest_team','guest_num_points']].rename(columns={'guest_team':'team_id','guest_num_points':"num_points"})

df = pd.concat([t1,t2])

d1 = df.merge(Teams, how='right', on='team_id')
d1['num_points'].fillna(0,inplace=True)
d1.groupby(['team_id','team_name'])['num_points'].sum().reset_index().sort_values(['num_points','team_id'],\
                                                                    ascending=[False, True])

   team_id    team_name  num_points
0       10  Leetcode FC         7.0
1       20   NewYork FC         3.0
4       50   Toronto FC         3.0
2       30   Atlanta FC         1.0
3       40   Chicago FC         0.0

# 1741. Find Total Time Spent by Each Employee

In [68]:
Employees=pd.DataFrame([["1","2020-11-28","4","32"],["1","2020-11-28","55","200"],\
                      ["1","2020-12-3","1","42"],["2","2020-11-28","3","33"],["2","2020-12-9","47","74"]],\
                      columns=["emp_id","event_day","in_time","out_time"])

In [69]:
Employees['out_time']=Employees['out_time'].astype(np.int64)
Employees['in_time']=Employees['in_time'].astype(np.int64)

In [70]:
Employees['dif']=Employees['out_time']-Employees['in_time']
Employees.groupby(['emp_id','event_day'])['dif'].sum().reset_index().rename({'emp_id':'emp_id','event_day':'day',\
                                                                            'dif':'total_name'})

  emp_id   event_day  dif
0      1  2020-11-28  173
1      1   2020-12-3   41
2      2  2020-11-28   30
3      2   2020-12-9   27

#  1747. Leetflex Banned Accounts  !!

In [105]:
LogInfo=pd.DataFrame([[1,1,"2021-02-01 09:00:00","2021-02-01 09:30:00"],\
                    [1,2,"2021-02-01 08:00:00","2021-02-01 11:30:00"],\
                    [2,6,"2021-02-01 20:30:00","2021-02-01 22:00:00"],\
                    [2,7,"2021-02-02 20:30:00","2021-02-02 22:00:00"],\
                    [3,9,"2021-02-01 16:00:00","2021-02-01 16:59:59"],\
                    [3,13,"2021-02-01 17:00:00","2021-02-01 17:59:59"],\
                    [4,10,"2021-02-01 16:00:00","2021-02-01 17:00:00"],\
                    [4,11,"2021-02-01 17:00:00","2021-02-01 17:59:59"]],
                    columns = ["account_id","ip_address","login","logout"])

In [106]:
LogInfo['login'] = pd.to_datetime(LogInfo['login'])
LogInfo['logout'] = pd.to_datetime(LogInfo['logout'])

In [103]:
## method 1
LogInfo.drop_duplicates(inplace=True)
LogInfo.sort_values(['account_id','login','logout'], inplace=True)
LogInfo['lag_login'] = LogInfo.groupby('account_id')['login'].shift(-1)
LogInfo[(LogInfo['lag_login']>=LogInfo['login']) & (LogInfo['lag_login']<=LogInfo['logout'])]['account_id'].drop_duplicates()

1    1
6    4
Name: account_id, dtype: int64

In [104]:
LogInfo

,account_id,ip_address,login,logout,lag_login
1,1,2,2021-02-01 08:00:00,2021-02-01 11:30:00,2021-02-01 09:00:00
0,1,1,2021-02-01 09:00:00,2021-02-01 09:30:00,NaT
2,2,6,2021-02-01 20:30:00,2021-02-01 22:00:00,2021-02-02 20:30:00
3,2,7,2021-02-02 20:30:00,2021-02-02 22:00:00,NaT
4,3,9,2021-02-01 16:00:00,2021-02-01 16:59:59,2021-02-01 17:00:00
5,3,13,2021-02-01 17:00:00,2021-02-01 17:59:59,NaT
6,4,10,2021-02-01 16:00:00,2021-02-01 17:00:00,2021-02-01 17:00:00
7,4,11,2021-02-01 17:00:00,2021-02-01 17:59:59,NaT

In [89]:
LogInfo.drop_duplicates(inplace=True)
LogInfo.sort_values(['account_id','ip_address','login','logout'], inplace=True)

In [100]:
LogInfo['login'].sort_values()

1   2021-02-01 08:00:00
0   2021-02-01 09:00:00
4   2021-02-01 16:00:00
6   2021-02-01 16:00:00
5   2021-02-01 17:00:00
7   2021-02-01 17:00:00
2   2021-02-01 20:30:00
3   2021-02-02 20:30:00
Name: login, dtype: datetime64[ns]

# 607. Sales Person 2021/7/25

In [117]:
salesperson = pd.DataFrame([[1, "John", 100000, 6, "4/1/2006"], [2, "Amy", 12000, 5,"5/1/2010"],\
                  [3, "Mark", 65000, 12, "12/25/2008"], [4, "Pam", 25000, 25,"1/1/2005"],\
                  [5,"Alex",5000,10,"2/3/2007"]],\
                           columns = ["sales_id", "name", "salary", "commission_rate","hire_date"])

company = pd.DataFrame( [[1, "RED","Boston"], [2, "ORANGE", "New York"],[3, "YELLOW", "Boston"],\
   [4, "GREEN", "Austin"]], columns = ["com_id", "name","city"])

orders = pd.DataFrame([[1,"1/1/2014",3,4,10000],[2, "2/1/2014", 4, 5, 5000],\
                    [3, "3/1/2014", 1, 1, 50000],[4, "4/1/2014", 1, 4, 25000]],
                     columns = ["order_id","order_date","com_id","sales_id","amount"])

In [124]:
df1 = orders.merge(company, how ='left', on='com_id')
salesperson[~salesperson['name'].\
            isin(list(salesperson[salesperson['sales_id'].\
                                  isin(list(df1[df1['name']=='RED']['sales_id']))]['name']))]['name']

1     Amy
2    Mark
4    Alex
Name: name, dtype: object

# 1919. Leetcodify Similar Friends

In [129]:
Listens = pd.DataFrame([[1,10,"2021-03-15"],[1,11,"2021-03-15"],[1,12,"2021-03-15"],[2,10,"2021-03-15"],\
                    [2,11,"2021-03-15"],[2,12,"2021-03-15"],[3,10,"2021-03-15"],[3,11,"2021-03-15"],\
                    [3,12,"2021-03-15"],[4,10,"2021-03-15"],[4,11,"2021-03-15"],[4,13,"2021-03-15"],\
                    [5,10,"2021-03-16"],[5,11,"2021-03-16"],[5,12,"2021-03-16"]],\
                      columns = ["user_id","song_id","day"])

Friendship = pd.DataFrame([[1,2],[2,4],[2,5]],\
                         columns = ["user1_id","user2_id"])

In [131]:
Listens = Listens.drop_duplicates()
Listens1=Listens.copy()
Listens.columns = ['user1_id','song_id','day']
Listens1.columns = ['user2_id','song_id','day']

df1= Listens.merge(Listens1, on=['day', 'song_id'], how='left')
df2=df1[df1['user2_id']>df1['user1_id']].groupby(['user2_id','user1_id','day']).\
filter(lambda x: x['song_id'].nunique()>=3)[['user2_id','user1_id']].drop_duplicates()

df2.merge(Friendship, on =['user1_id', 'user2_id'], how='inner')[['user1_id', 'user2_id']]

   user1_id  user2_id
0         1         2

# 1917. Leetcodify Friends Recommendations

In [146]:
Friendship = pd.DataFrame([[1,2]],\
                         columns = ["user1_id","user2_id"])

In [168]:
Listens = Listens.drop_duplicates()
Listens.columns = ['user1_id','song_id','day']
Listens1.columns = ['user2_id','song_id','day']

df1= Listens.merge(Listens1, on=['day', 'song_id'], how='left')
df2=df1[df1['user2_id']>df1['user1_id']].groupby(['user2_id','user1_id','day']).\
filter(lambda x: x['song_id'].nunique()>=3)[['user1_id','user2_id']].drop_duplicates()


Friendship.columns =['user_id','recommended_id']


df5 = df2.merge(Friendship, how='left',left_on =['user1_id', 'user2_id'],\
               right_on=['user_id', 'recommended_id'] )
import numpy as np
df6 = df5[df5['user_id'].isna()| df5['recommended_id'].isna()][['user1_id','user2_id']]

df7=df6[['user2_id','user1_id']]
df6.columns =['user_id','recommended_id']
df7.columns =['user_id','recommended_id']
pd.concat([df6,df7])

   user_id  recommended_id
1        1               3
2        2               3
1        3               1
2        3               2

# 1384. Total Sales Amount by Year

In [170]:
Product = pd.DataFrame([[1, "LC Phone "], [2, "LC T-Shirt"], [3, "LC Keychain"]],\
                       columns = ["product_id", "product_name"])
Sales = pd.DataFrame([[1, "2019-01-25", "2019-02-28", 100], [2, "2018-12-01", "2020-01-01", 10],[3, "2019-12-01", "2020-01-31", 1]],\
                    columns =["product_id", "period_start", "period_end", "average_daily_sales"])
Sales['period_start'] = pd.to_datetime(Sales['period_start'])
Sales['period_end'] = pd.to_datetime(Sales['period_end'])

In [181]:
min_dt = Sales.period_start.min()
max_dt = Sales.period_end.max()
dt_range = pd.DataFrame(pd.date_range(min_dt, max_dt), columns = ['dates'])   

dt_range ['key'] = 0
Sales['key'] = 0


df = Sales.merge(Product, how='left', on=['product_id']).merge(dt_range, how='outer', on='key')
df['report_year'] = df['dates'].dt.year
df = df[(df['dates']>=df['period_start']) & (df['dates']<=df['period_end'])]

df1=df.groupby(['product_id','product_name','report_year','average_daily_sales'])['dates'].\
count().reset_index(name='cnt')

df1['total_amount']=df1['cnt']*df1['average_daily_sales']
df1[['product_id','product_name','report_year','total_amount']]

   product_id product_name  report_year  total_amount
0           1    LC Phone          2019          3500
1           2   LC T-Shirt         2018           310
2           2   LC T-Shirt         2019          3650
3           2   LC T-Shirt         2020            10
4           3  LC Keychain         2019            31
5           3  LC Keychain         2020            31

# 1479. Sales by Day of the Week

In [ ]:
{"headers": {"Orders": ["order_id", "customer_id", "order_date", "item_id", "quantity"], 
             "Items":
             ["item_id", "item_name", "item_category"]}, 
 "rows": {"Orders": [[1, 1, "2020-06-01", 1, 10], [2, 1, "2020-06-08", 2, 10], [3, 2, "2020-06-02", 1, 5],
                     [4, 3, "2020-06-03", 3, 5], [5, 4, "2020-06-04", 4, 1], [6, 4, "2020-06-05", 5, 5], 
                     [7, 5, "2020-06-05", 1, 10], [8, 5, "2020-06-14", 4, 5], [9, 5, "2020-06-21", 3, 5]],
          "Items": [[1, "LC Alg. Book", "Book"], [2, "LC DB. Book", "Book"], [3, "LC SmarthPhone", "Phone"], 
[4, "LC Phone 2020", "Phone"], [5, "LC SmartGlass", "Glasses"], [6, "LC T-Shirt XL", "T-shirt"]]}}

In [224]:
Orders = pd.DataFrame([[1, 1, "2020-06-01", 1, 10], [2, 1, "2020-06-08", 2, 10], [3, 2, "2020-06-02", 1, 5],[4, 3, "2020-06-03", 3, 5], [5, 4, "2020-06-04", 4, 1], [6, 4, "2020-06-05", 5, 5],[7, 5, "2020-06-05", 1, 10], [8, 5, "2020-06-14", 4, 5], [9, 5, "2020-06-21", 3, 5]],\
                     columns =["order_id", "customer_id", "order_date", "item_id", "quantity"])


Items = pd.DataFrame([[1, "LC Alg. Book", "Book"], [2, "LC DB. Book", "Book"], [3, "LC SmarthPhone", "Phone"],[4, "LC Phone 2020", "Phone"], [5, "LC SmartGlass", "Glasses"], [6, "LC T-Shirt XL", "T-shirt"]],\
                    columns = ["item_id", "item_name", "item_category"] )

Orders['order_date']=pd.to_datetime(Orders['order_date'])

In [234]:
days = pd.DataFrame(['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday','Sunday'],columns = ['weekday'])

In [235]:
days['key']=0
Items['key']=0
Orders['weekday']=Orders['order_date'].dt.strftime('%A')
df = days.merge(Items, on='key',how='outer').merge(Orders, how ='left', on=['item_id','weekday'])

df = df.fillna(0)

df1 = df.groupby(['item_category','weekday'])['quantity'].sum().reset_index()

df2=df1.pivot(index='item_category',columns = 'weekday')['quantity'].reset_index()

df2=df2.fillna(0)


df2[['item_category', 'Monday', 'Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday']].sort_values(by='item_category')

weekday,item_category,Monday,Tuesday,Wednesday,Thursday,Friday,Saturday,Sunday
0,Book,20.0,5.0,0.0,0.0,10.0,0.0,0.0
1,Glasses,0.0,0.0,0.0,0.0,5.0,0.0,0.0
2,Phone,0.0,0.0,5.0,1.0,0.0,0.0,10.0
3,T-shirt,0.0,0.0,0.0,0.0,0.0,0.0,0.0

# 626. Exchange Seats 2021/8/2

In [5]:
import pandas as pd
import numpy as np

In [8]:
seat = pd.DataFrame([[1,"Abbot"],[2,"Doris"],[3,"Emerson"],[4,"Green"],[5,"Jeames"]],\
                  columns =  ["id","student"])

In [9]:
seat['id']=np.where(seat['id']%2==0,seat['id']-1, np.where((seat['id']%2==1) & (seat['id']!=max(seat['id'])),\
                                                            seat['id']+1, seat['id']))

seat[['id','student']].sort_values(by='id')

   id  student
1   1    Doris
0   2    Abbot
3   3    Green
2   4  Emerson
4   5   Jeames

# 580. Count Student Number in Departments

In [ ]:
{"headers":{"student":["student_id","student_name","gender","dept_id"],"department":["dept_id","dept_name"]},"rows":{"student":
                                                                                                                     [[1,"Jack","M",1],[2,"Jane","F",1],[3,"Mark","M",2]],
                                                                                                                     "department":[[1,"Engineering"],[2,"Science"],[3,"Law"]]}}

In [10]:
student = pd.DataFrame([[1,"Jack","M",1],[2,"Jane","F",1],[3,"Mark","M",2]],\
                      columns=["student_id","student_name","gender","dept_id"])
department = pd.DataFrame([[1,"Engineering"],[2,"Science"],[3,"Law"]], columns = ["dept_id","dept_name"])

In [22]:
df1 = student.groupby('dept_id')['student_id'].nunique().reset_index(name='student_number')
department.merge(df1, how='left', on='dept_id').fillna(0)[['dept_name','student_number']].\
sort_values(['student_number','dept_name'], ascending=[False, True])

     dept_name  student_number
0  Engineering             2.0
1      Science             1.0
2          Law             0.0

In [21]:
department.merge(df1, how='left', on='dept_id').fillna(0)[['dept_name','student_number']]

     dept_name  student_number
0  Engineering             2.0
1      Science             1.0
2          Law             0.0

# 184. Department Highest Salary

In [ ]:
{"headers": {"Employee": ["Id", "Name", "Salary", "DepartmentId"], 
             "Department": ["Id", "Name"]}, "rows": 
 {"Employee": [[1, "Joe", 70000, 1], [2, "Jim", 90000, 1], 
               [3, "Henry", 80000, 2], [4, "Sam", 60000, 2], [5, "Max", 90000, 1]], 
  "Department": [[1, "IT"], [2, "Sales"]]}}

In [23]:
Employee=pd.DataFrame([[1, "Joe", 70000, 1], [2, "Jim", 90000, 1],\
               [3, "Henry", 80000, 2], [4, "Sam", 60000, 2], [5, "Max", 90000, 1]],\
                     columns = ["Id", "Name", "Salary", "DepartmentId"])
Department = pd.DataFrame([[1, "IT"], [2, "Sales"]], columns = ["Id", "Name"] )

In [24]:
Employee['rank'] = Employee.groupby('DepartmentId')['Salary'].rank(method='dense',ascending=False)
Employee = Employee.query("rank==1")
Employee.columns = ['Id','Employee','Salary','DepartmentId', 'rank']
Department.columns =['Id','Department']
Employee.merge(Department, how='inner',left_on='DepartmentId', right_on='Id')[['Department','Employee','Salary']]

  Department Employee  Salary
0         IT      Jim   90000
1         IT      Max   90000
2      Sales    Henry   80000

# 262. Trips and Users

In [37]:
Trips=pd.DataFrame([["1", "1", "10", "1", "completed", "2013-10-01"],\
                    ["2", "2", "11", "1", "cancelled_by_driver", "2013-10-01"],\
                    ["3", "3", "12", "6", "completed", "2013-10-01"],\
                    ["4", "4", "13", "6", "cancelled_by_client", "2013-10-01"],\
                    ["5", "1", "10", "1", "completed", "2013-10-02"],\
                    ["6", "2", "11", "6", "completed", "2013-10-02"],\
                    ["7", "3", "12", "6", "completed", "2013-10-02"],\
                    ["8", "2", "12", "12", "completed", "2013-10-03"],\
                    ["9", "3", "10", "12", "completed", "2013-10-03"],\
                    ["10", "4", "13", "12", "cancelled_by_driver", "2013-10-03"]],\
                  columns = ["Id", "Client_Id", "Driver_Id", "City_Id", "Status", "Request_at"])

Users = pd.DataFrame([["1", "No", "client"], ["2", "Yes", "client"], ["3", "No", "client"], ["4", "No", "client"],\
                    ["10", "No", "driver"], ["11", "No", "driver"], ["12", "No", "driver"], ["13", "No", "driver"]],
                    columns =["Users_Id", "Banned", "Role"])

In [38]:
Trips['Day']=pd.to_datetime(Trips['Request_at'])
Trips=Trips.query("Day >= '2013-10-01' and Day <= '2013-10-03'")

unbanned = list(Users.query("Banned=='No'")['Users_Id'])
Trips = Trips[(Trips['Client_Id'].isin(unbanned)) & (Trips['Driver_Id'].isin(unbanned))]
Trips.groupby('Day').\
apply(lambda x: pd.Series({'Cancellation Rate':\
x[(x['Status']=='cancelled_by_driver')|(x['Status']=='cancelled_by_client')]['Id'].count()/x['Id'].count()})).\
reset_index().round(2).sort_values('Day')

         Day  Cancellation Rate
0 2013-10-01               0.33
1 2013-10-02               0.00
2 2013-10-03               0.50

# 1321. Restaurant Growth

In [ ]:
{"headers":{"Customer":["customer_id","name","visited_on","amount"]},
 "rows":{"Customer":[[1,"Jhon","2019-01-01",100],[2,"Daniel","2019-01-02",110],[3,"Jade","2019-01-03",120],
                     [4,"Khaled","2019-01-04",130],[5,"Winston","2019-01-05",110],[6,"Elvis","2019-01-06",140],
                     [7,"Anna","2019-01-07",150],[8,"Maria","2019-01-08",80],[9,"Jaze","2019-01-09",110],
                     [1,"Jhon","2019-01-10",130],[3,"Jade","2019-01-10",150]]}}

In [102]:
Customer = pd.DataFrame([[1,"Jhon","2019-01-01",100],[2,"Daniel","2019-01-02",110],[3,"Jade","2019-01-03",120],\
                     [4,"Khaled","2019-01-04",130],[5,"Winston","2019-01-05",110],[6,"Elvis","2019-01-06",140],\
                     [7,"Anna","2019-01-07",150],[8,"Maria","2019-01-08",80],[9,"Jaze","2019-01-09",110],\
                     [1,"Jhon","2019-01-10",130],[3,"Jade","2019-01-10",150]],\
                    columns = ["customer_id","name","visited_on","amount"])

In [103]:
Customer['visited_on']=pd.to_datetime(Customer['visited_on'])

Customer = Customer.groupby('visited_on')['amount'].sum().reset_index()


## below is optioanl
import datetime as dt
min_dates = Customer['visited_on'].min()+pd.DateOffset(days=6)
Customer.sort_values('visited_on',inplace=True)

In [104]:
import datetime
min_dates = Customer['visited_on'].min()+pd.DateOffset(days=6)

In [105]:
Customer

  visited_on  amount
0 2019-01-01     100
1 2019-01-02     110
2 2019-01-03     120
3 2019-01-04     130
4 2019-01-05     110
5 2019-01-06     140
6 2019-01-07     150
7 2019-01-08      80
8 2019-01-09     110
9 2019-01-10     280

In [106]:
# correct answer
Customer['average_amount']=Customer['amount'].rolling(window=7).mean().round(2)
Customer['total_amount']=Customer['amount'].rolling(window=7).sum()
Customer.drop('amount', axis=1,inplace=True)
Customer.dropna().sort_values('visited_on')

  visited_on  average_amount  total_amount
6 2019-01-07          122.86         860.0
7 2019-01-08          120.00         840.0
8 2019-01-09          120.00         840.0
9 2019-01-10          142.86        1000.0

# 1173. Immediate Food Delivery I   2021/8/4

In [107]:
Delivery= pd.DataFrame([[1,1,"2019-08-01","2019-08-02"],[2,5,"2019-08-02","2019-08-02"],\
[3,1,"2019-08-11","2019-08-11"],[4,3,"2019-08-24","2019-08-26"],[5,4,"2019-08-21","2019-08-22"],\
                     [6,2,"2019-08-11","2019-08-13"]],\
                      columns=["delivery_id","customer_id","order_date","customer_pref_delivery_date"])

In [114]:
Delivery

   delivery_id  customer_id  order_date customer_pref_delivery_date
0            1            1  2019-08-01                  2019-08-02
1            2            5  2019-08-02                  2019-08-02
2            3            1  2019-08-11                  2019-08-11
3            4            3  2019-08-24                  2019-08-26
4            5            4  2019-08-21                  2019-08-22
5            6            2  2019-08-11                  2019-08-13

In [117]:
def my_func(df):
    
    if df['order_date']==df['customer_pref_delivery_date']:
        return 1
    else:
        return 0

In [124]:
round(Delivery.apply(my_func, axis=1).sum()/len(Delivery)*100,2)

33.33

# 1767. Find the Subtasks That Did Not Execute

In [185]:
Tasks = pd.DataFrame( [[1, 3], [2, 2], [3, 4]], columns=["task_id", "subtasks_count"])
Executed = pd.DataFrame([[1, 2], [3, 1], [3, 2], [3, 3], [3, 4]], columns = ["task_id", "subtask_id"])

In [186]:
Tasks

   task_id  subtasks_count
0        1               3
1        2               2
2        3               4

In [187]:

def my_func(Tasks):
    y=[]
    for i in Tasks['subtasks_count']:
        y.append(list(range(1,i+1)))        
    return y

In [188]:
df = pd.concat([Tasks['task_id'], pd.DataFrame(my_func(Tasks))], axis=1)

In [189]:
# wide to long
df_long = df.melt(id_vars='task_id').dropna()

In [190]:
df_long.merge(Executed, how='left', right_on=['task_id','subtask_id'], left_on=['task_id','value'])\
.query("subtask_id.isnull()")[['task_id','value']].sort_values('task_id')\
.rename(columns={'task_id':'task_id', 'value': 'subtask_id'})

   task_id  subtask_id
0        1         1.0
6        1         3.0
1        2         1.0
4        2         2.0

# 1596. The Most Frequently Ordered Products for Each Customer

In [196]:
Customers=pd.DataFrame([[1,"Alice"],[2,"Bob"],[3,"Tom"],[4,"Jerry"],[5,"John"]], columns = ["customer_id","name"])
Orders = pd.DataFrame([[1,"2020-07-31",1,1],[2,"2020-7-30",2,2],[3,"2020-08-29",3,3],[4,"2020-07-29",4,1],\
                   [5,"2020-06-10",1,2],[6,"2020-08-01",2,1],[7,"2020-08-01",3,3],[8,"2020-08-03",1,2],\
                   [9,"2020-08-07",2,3],[10,"2020-07-15",1,2]],\
                     columns = ["order_id","order_date","customer_id","product_id"])
Products = pd.DataFrame([[1,"keyboard",120],[2,"mouse",80],[3,"screen",600],[4,"hard disk",450]],\
                       columns = ["product_id","product_name","price"])

In [197]:
Orders= Orders.groupby(["customer_id","product_id"])["order_id"].count().reset_index(name='cnt')
Orders['rnk']=Orders.groupby(["customer_id"])["cnt"].rank(method='dense', ascending=False)
Orders

   customer_id  product_id  cnt  rnk
0            1           1    1  2.0
1            1           2    3  1.0
2            2           1    1  1.0
3            2           2    1  1.0
4            2           3    1  1.0
5            3           3    2  1.0
6            4           1    1  1.0

In [200]:
Orders.query("rnk==1").merge(Products, how='inner',on='product_id')[['customer_id',"product_id","product_name"]]\
.sort_values(["customer_id","product_id"])

   customer_id  product_id product_name
0            1           2        mouse
2            2           1     keyboard
1            2           2        mouse
4            2           3       screen
5            3           3       screen
3            4           1     keyboard

# 1549. The Most Recent Orders for Each Product

In [202]:
Orders=pd.DataFrame([[1,"2020-07-31",1,1],[2,"2020-7-30",2,2],[3,"2020-08-29",3,3],[4,"2020-07-29",4,1],\
                   [5,"2020-06-10",1,2],[6,"2020-08-01",2,1],[7,"2020-08-01",3,1],[8,"2020-08-03",1,2],\
                   [9,"2020-08-07",2,3],[10,"2020-07-15",1,2]],\
                   columns = ["order_id","order_date","customer_id","product_id"])
Products = pd.DataFrame([[1,"keyboard",120],[2,"mouse",80],[3,"screen",600],[4,"hard disk",450]],\
                        columns=["product_id","product_name","price"])

In [205]:
Orders['order_date']=pd.to_datetime(Orders['order_date'])
Orders['rnk'] = Orders.groupby(["product_id"])['order_date'].rank(method='dense', ascending=False)

In [209]:
Orders.query("rnk==1").merge(Products,how='inner',on='product_id')\
[["product_name","product_id","order_id","order_date"]].sort_values(["product_name","order_id","order_date"])

  product_name  product_id  order_id order_date
1     keyboard           1         6 2020-08-01
2     keyboard           1         7 2020-08-01
3        mouse           2         8 2020-08-03
0       screen           3         3 2020-08-29

# 1635. Hopper Company Queries I

In [274]:
Drivers = pd.DataFrame([[10,"2019-12-10"],[8,"2020-1-13"],[5,"2020-2-16"],[7,"2020-3-8"],[4,"2020-5-17"],\
                    [1,"2020-10-24"],[6,"2021-1-5"]], columns = ["driver_id","join_date"])
Rides = pd.DataFrame([[6,75,"2019-12-9"],[1,54,"2020-2-9"],\
            [10,63,"2020-3-4"],[19,39,"2020-4-6"],[3,41,"2020-6-3"],[13,52,"2020-6-22"],\
    [7,69,"2020-7-16"],[17,70,"2020-8-25"],[20,81,"2020-11-2"],[5,57,"2020-11-9"],\
[2,42,"2020-12-9"],[11,68,"2021-1-11"],[15,32,"2021-1-17"],[12,11,"2021-1-19"],[14,18,"2021-1-27"]],\
                    columns = ["ride_id","user_id","requested_at"])
AcceptedRides = pd.DataFrame([[10,10,63,38],[13,10,73,96],[7,8,100,28],[17,7,119,68],[20,1,121,92],[5,7,42,101],\
                          [2,4,6,38],[11,8,37,43],[15,8,108,82],[12,8,38,34],[14,1,90,74]],\
                            columns = ["ride_id","driver_id","ride_distance","ride_duration"])

In [275]:
month = pd.DataFrame(range(1,13),columns = ['month'])

In [276]:
Drivers["join_date"]=pd.to_datetime(Drivers["join_date"])
Rides["requested_at"]=pd.to_datetime(Rides["requested_at"])
Drivers['month']=Drivers["join_date"].dt.month
Drivers['year']=Drivers["join_date"].dt.year
Rides['month']=Rides['requested_at'].dt.month

In [277]:
Drivers1=Drivers.query("year==2020").groupby(['month'])['driver_id'].count().reset_index(name='driver_cnt')\
.sort_values("month")
Drivers1['active_drivers'] = Drivers1['driver_cnt'].cumsum()+Drivers.query("year<2020")['driver_id'].count()

In [278]:
df = month.merge(Drivers1[['month','active_drivers']], how='left',on='month').fillna(method='ffill')

In [283]:
df2 = Rides.query("requested_at.dt.year==2020").merge(AcceptedRides, how='inner',on='ride_id')\
.groupby("month")['ride_id'].count().reset_index(name='accepted_rides')

In [284]:
df.merge(df2, how='left',on='month').fillna(0)

    month  active_drivers  accepted_rides
0       1             2.0             0.0
1       2             3.0             0.0
2       3             4.0             1.0
3       4             4.0             0.0
4       5             5.0             0.0
5       6             5.0             1.0
6       7             5.0             1.0
7       8             5.0             1.0
8       9             5.0             0.0
9      10             6.0             0.0
10     11             6.0             2.0
11     12             6.0             1.0

# 1645. Hopper Company Queries II   2021/8/4

In [326]:
Drivers = pd.DataFrame([[10,"2019-12-10"],[8,"2020-1-13"],[5,"2020-2-16"],[7,"2020-3-8"],[4,"2020-5-17"],\
                    [1,"2020-10-24"],[6,"2021-1-5"]], columns = ["driver_id","join_date"])
Rides = pd.DataFrame([[6,75,"2019-12-9"],[1,54,"2020-2-9"],\
[10,63,"2020-3-4"],[19,39,"2020-4-6"],[3,41,"2020-6-3"],[13,52,"2020-6-22"],[7,69,"2020-7-16"],\
[17,70,"2020-8-25"],[20,81,"2020-11-2"],[5,57,"2020-11-9"],[2,42,"2020-12-9"],[11,68,"2021-1-11"]\
,[15,32,"2021-1-17"],[12,11,"2021-1-19"],[14,18,"2021-1-27"]],\
                    columns = ["ride_id","user_id","requested_at"])
AcceptedRides = pd.DataFrame([[10,10,63,38],[13,10,73,96],[7,8,100,28],[17,7,119,68],[20,1,121,92],[5,7,42,101],\
                              [2,4,6,38],[11,8,37,43],[15,8,108,82],[12,8,38,34],[14,1,90,74]],\
                            columns = ["ride_id","driver_id","ride_distance","ride_duration"])

In [327]:
# create month from 1 to 12
month = pd.DataFrame(range(1,13),columns = ['month'])

Drivers["join_date"]=pd.to_datetime(Drivers["join_date"])
Rides["requested_at"]=pd.to_datetime(Rides["requested_at"])
Drivers['month']=Drivers["join_date"].dt.month
Drivers['year']=Drivers["join_date"].dt.year
Rides['month']=Rides['requested_at'].dt.month

In [328]:
Drivers = Drivers.groupby(['join_date', 'month'])['driver_id'].count().reset_index(name='driver_cnt').sort_values('join_date')
Drivers['active_drivers']=Drivers['driver_cnt'].cumsum()
Drivers = Drivers.query("join_date.dt.year==2020")
Drivers=month.merge(Drivers[['month','active_drivers']],on='month',how='left').fillna(method='ffill')

In [329]:
work=Rides.query("requested_at.dt.year==2020").merge(AcceptedRides, how='inner',on='ride_id').\
groupby('month')['driver_id'].nunique().reset_index(name='working')

In [330]:
work

   month  working
0      3        1
1      6        1
2      7        1
3      8        1
4     11        2
5     12        1

In [331]:
df = month.merge(Drivers, on='month',how='left').merge(work,on='month',how='left')

df['working_percentage']=round(df['working']*100/df['active_drivers'],2)
df['working_percentage'].fillna(0, inplace=True)
df[['month','working_percentage']]

    month  working_percentage
0       1                0.00
1       2                0.00
2       3               25.00
3       4                0.00
4       5                0.00
5       6               20.00
6       7               20.00
7       8               20.00
8       9                0.00
9      10                0.00
10     11               33.33
11     12               16.67

# 1651. Hopper Company Queries III

In [337]:
rides = Rides.query("requested_at.dt.year==2020").merge(AcceptedRides, how='inner',on='ride_id').\
groupby('month')["ride_distance","ride_duration"].sum().reset_index()

In [346]:
df = month.merge(rides,how='left',on='month').fillna(0).sort_values('month')
pd.concat([month-2, df.rolling(window=3,min_periods=1)[["ride_distance","ride_duration"]].mean()\
.rename(columns={'ride_distance':'average_ride_distance','ride_duration':'average_ride_duration'}).round(2)],axis=1)\
.query("month>0")

    month  average_ride_distance  average_ride_duration
2       1                  21.00                  12.67
3       2                  21.00                  12.67
4       3                  21.00                  12.67
5       4                  24.33                  32.00
6       5                  57.67                  41.33
7       6                  97.33                  64.00
8       7                  73.00                  32.00
9       8                  39.67                  22.67
10      9                  54.33                  64.33
11     10                  56.33                  77.00

# 1683. Invalid Tweets

In [ ]:
{"headers":{"Tweets":["tweet_id","content"]},"rows":{"Tweets":[[1,"Vote for Biden"],
                                                               [2,"Let us make America great again!"]]}}

In [352]:
Tweets=pd.DataFrame([[1,"Vote for Biden"],[2,"Let us make America great again!"]],\
                   columns = ["tweet_id","content"])
Tweets[Tweets['content'].str.len()>15]['tweet_id']

1    2
Name: tweet_id, dtype: int64

In [349]:
len(Tweets['content'])

2

In [351]:
Tweets['content'].str.len()>15

0    False
1     True
Name: content, dtype: bool

# 603. Consecutive Available Seats

In [355]:
cinema=pd.DataFrame([[1,1],[2,0],[3,1],[4,1],[5,1]], columns = ["seat_id","free"])
cinema['prior_seat']= cinema['free'].shift()
cinema['lag_seat']= cinema['free'].shift(-1)
cinema.query("free==1 and (prior_seat==1 or lag_seat==1)")['seat_id']

2    3
3    4
4    5
Name: seat_id, dtype: int64

# 1303. Find the Team Size

In [356]:
Employee=pd.DataFrame([[1,8],[2,8],[3,8],[4,7],[5,9],[6,9]], columns = ["employee_id","team_id"])

In [357]:
Employee.merge(Employee.groupby('team_id')['employee_id'].count().reset_index(name='team_size'),
               how='left', on='team_id')[["employee_id",'team_size']]

   employee_id  team_size
0            1          3
1            2          3
2            3          3
3            4          1
4            5          2
5            6          2

# 175. Combine Two Tables 2021/8/7

In [1]:
import pandas as pd
import numpy as np
import datetime

In [2]:
Person = pd.DataFrame([[1, "Wang", "Allen"]], columns =["PersonId", "LastName", "FirstName"] )
Address = pd.DataFrame([[1, 2, "New York City", "New York"]],\
                       columns = ["AddressId", "PersonId", "City", "State"])

In [3]:
Person.merge(Address, how='left', on='PersonId')[["LastName", "FirstName","City", "State"]]

  LastName FirstName City State
0     Wang     Allen  NaN   NaN

# 1892. Page Recommendations II

In [ ]:
{"headers":{"Friendship":["user1_id","user2_id"],"Likes":["user_id","page_id"]},
 "rows":{"Friendship":[[1,2],[1,3],[1,4],[2,3],[2,4],[2,5],[6,1]],
         "Likes":[[1,88],[2,23],[3,24],[4,56],[5,11],[6,33],[2,77],[3,77],[6,88]]}}

In [12]:
Friendship = pd.DataFrame([[1,2],[1,3],[1,4],[2,3],[2,4],[2,5],[6,1]], columns = ["user1_id","user2_id"])
Likes = pd.DataFrame([[1,88],[2,23],[3,24],[4,56],[5,11],[6,33],[2,77],[3,77],[6,88]], columns = ["user_id","page_id"])

In [13]:
Friendship2 = Friendship[["user2_id","user1_id"]]
Friendship2.columns =["user1_id","user2_id"]
Friends = pd.concat([Friendship,Friendship2]).drop_duplicates()
Likes1=Likes.copy()
Likes1.columns = ["user_id","page2_id"]

In [25]:
Friends.merge(Likes, how='left', left_on='user2_id',right_on='user_id')\
.merge(Likes1, how='left', left_on=['user1_id','page_id'],right_on=['user_id', 'page2_id']).dropna().\
groupby(['user1_id','page_id'])

                  user2_id  user_id_x  user_id_y  page2_id
user1_id page_id
1        88              1          1          1         1
2        77              1          1          1         1
3        77              1          1          1         1
6        88              1          1          1         1

In [35]:
df = Friends.merge(Likes, how='left', left_on='user2_id',right_on='user_id')\
.merge(Likes1, how='left', left_on=['user1_id','page_id'],right_on=['user_id', 'page2_id']).\
groupby(['user1_id','page_id']).\
filter(lambda x: x['page2_id'].isnull().any())

df.groupby(['user1_id','page_id'])['user2_id'].count().reset_index()\
.rename(columns={'user1_id':'user_id','page_id':"page_id",'user2_id':'friends_likes'}).\
sort_values(['user_id','friends_likes','page_id'], ascending=[True, False, True])

    user_id  page_id  friends_likes
4         1       77              2
0         1       23              1
1         1       24              1
2         1       33              1
3         1       56              1
5         2       11              1
6         2       24              1
7         2       56              1
8         2       88              1
9         3       23              1
10        3       88              1
11        4       23              1
12        4       77              1
13        4       88              1
14        5       23              1
15        5       77              1

# 1407. Top Travellers 2021/9/20

In [2]:
import pandas as pd
import numpy as np
Users=pd.DataFrame([[1,"Alice"],[2,"Bob"],[3,"Alex"],[4,"Donald"],[7,"Lee"],[13,"Jonathan"],[19,"Elvis"]],\
                  columns=["id","name"])

Rides = pd.DataFrame([[1,1,120],[2,2,317],[3,3,222],[4,7,100],[5,13,312],[6,19,50],[7,7,120],[8,19,400],[9,7,230]],\
                    columns = ["id","user_id","distance"])

In [6]:
Users.merge(Rides, how='left',left_on='id',right_on='user_id').groupby(['name'])['distance'].sum().\
reset_index(name='travelled_distance').fillna(0).sort_values(['travelled_distance','name'],ascending=[False,True])

       name  travelled_distance
4     Elvis               450.0
6       Lee               450.0
2       Bob               317.0
5  Jonathan               312.0
0      Alex               222.0
1     Alice               120.0
3    Donald                 0.0

# 1364. Number of Trusted Contacts of a Customer

In [7]:
Customers = pd.DataFrame([[1,"Alice","alice@leetcode.com"],[2,"Bob","bob@leetcode.com"],\
                          [13,"John","john@leetcode.com"],[6,"Alex","alex@leetcode.com"]],\
                        columns = ["customer_id","customer_name","email"])
Contacts = pd.DataFrame([[1,"Bob","bob@leetcode.com"],[1,"John","john@leetcode.com"],\
                     [1,"Jal","jal@leetcode.com"],[2,"Omar","omar@leetcode.com"],\
                     [2,"Meir","meir@leetcode.com"],[6,"Alice","alice@leetcode.com"]],\
                       columns = ["user_id","contact_name","contact_email"])
Invoices = pd.DataFrame([[77,100,1],[88,200,1],[99,300,2],[66,400,2],[55,500,13],[44,60,6]],\
                       columns = ["invoice_id","price","user_id"])

In [21]:
Invoices.merge(Customers, how='left', left_on='user_id',right_on='customer_id').\
merge(Contacts, how='left',on='user_id').\
merge(Contacts[Contacts['contact_email'].isin(list(Customers['email']))], how='left',on=['user_id','contact_email']).\
groupby(["customer_name","invoice_id","price"])['contact_name_x','contact_name_y'].count().\
reset_index().fillna(0).rename(columns={'customer_name':'customer_name','invoice_id':"invoice_id",'price':'price',\
'contact_name_x':'contacts_cnt','contact_name_y':'trusted_contacts_cnt'}).\
sort_values('invoice_id')

  customer_name  invoice_id  price  contacts_cnt  trusted_contacts_cnt
0          Alex          44     60             1                     1
5          John          55    500             0                     0
3           Bob          66    400             2                     0
1         Alice          77    100             3                     2
2         Alice          88    200             3                     2
4           Bob          99    300             2                     0

# 1907. Count Salary Categories

In [28]:
Accounts = pd.DataFrame([[3,108939],[2,12747],[8,87709],[6,91796]],columns = ["account_id","income"])

In [29]:
cat = pd.DataFrame(['Low Salary','Average Salary','High Salary'], columns = ['category'])
Accounts['category'] = np.where(Accounts['income']<20000,'Low Salary',\
                                np.where(Accounts['income']>50000,'High Salary','Average Salary'))

In [30]:
cat.merge(Accounts, how='left', on= ['category']).groupby(['category'])['account_id'].count()\
.reset_index(name='accounts_count').fillna(0)

         category  accounts_count
0  Average Salary               0
1     High Salary               3
2      Low Salary               1

# 1435. Create a Session Bar Chart

In [42]:
Sessions = pd.DataFrame([[1, 30], [2, 199], [3, 299], [4, 580], [5, 1000]], columns = ["session_id", "duration"])

In [35]:
bins=pd.DataFrame(["[0-5>", "[5-10>", "[10-15>","15 minutes or more"], columns =["bin"])

### method 1
Sessions['bin']=np.where(Sessions['duration']/60<5,"[0-5>",\
np.where(Sessions['duration']/60>15,"15 minutes or more",\
         np.where(Sessions['duration']/60<10,"[5-10>", "[10-15>")))

In [43]:
## method 2
conditions = {
    '[0-5>': Sessions['duration']/60<5,\
    '[5-10>': (Sessions['duration']/60>=5) & (Sessions['duration']/60<10),\
    '[10-15>': (Sessions['duration']/60>=10) & (Sessions['duration']/60<15),\
    '15 minutes or more': (Sessions['duration']/60>15)\
}
Sessions['bin'] = np.select(conditions.values(), conditions.keys(), default='Partial')
Sessions

   session_id  duration                 bin
0           1        30               [0-5>
1           2       199               [0-5>
2           3       299               [0-5>
3           4       580              [5-10>
4           5      1000  15 minutes or more

In [44]:
bins.merge(Sessions,how='left',on='bin').groupby(['bin'])['session_id'].count().reset_index(name='total')

                  bin  total
0  15 minutes or more      1
1               [0-5>      3
2             [10-15>      0
3              [5-10>      1

# 574. Winning Candidate

In [47]:
Candidate=pd.DataFrame([[1,"A"],[2,"B"],[3,"C"],[4,"D"],[5,"E"]], columns = ["id","Name"])
Vote = pd.DataFrame([[1,2],[2,4],[3,3],[4,2],[5,5]], columns = ["id","CandidateId"])

In [53]:
ids = list(Vote.groupby(['CandidateId'])['id'].count().reset_index(name='cnt').nlargest(1,'cnt')["CandidateId"])
Candidate[Candidate['id'].isin(ids)]['Name']

1    B
Name: Name, dtype: object

# 180. Consecutive Numbers 2021/9/21

In [54]:
Logs = pd.DataFrame([[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]], columns = ["Id", "Num"])

In [57]:
Logs['lag_1']=Logs['Num'].shift(1)
Logs['lag_2']=Logs['Num'].shift(2)
Logs[(Logs['Num'] ==Logs['lag_1']) &(Logs['Num'] ==Logs['lag_2'])]['Num'].unique()

array([1])

# 1841. League Statistics

In [58]:
Teams = pd.DataFrame([[1,"Ajax"],[4,"Dortmund"],[6,"Arsenal"]], columns = ["team_id","team_name"])
Matches = pd.DataFrame([[1,4,0,1],[1,6,3,3],[4,1,5,2],[6,1,0,0]], columns = ["home_team_id","away_team_id",\
                                                                             "home_team_goals","away_team_goals"])

In [60]:
Conditions = [Matches['home_team_goals']>Matches['away_team_goals'],\
                   Matches['home_team_goals']==Matches['away_team_goals'],
                  Matches['home_team_goals']<Matches['away_team_goals']]

results_home=[3,1,0]
results_away=[0,1,3]


Matches['points_home'] = np.select(Conditions, results_home)
Matches['points_away'] = np.select(Conditions, results_away)

In [62]:
Matches.columns

Index(['home_team_id', 'away_team_id', 'home_team_goals', 'away_team_goals',
       'points_home', 'points_away'],
      dtype='object')

In [64]:
Matches_home = Matches[['home_team_id','home_team_goals','away_team_goals','points_home']]
Matches_away = Matches[['away_team_id','away_team_goals','home_team_goals','points_away']]

In [65]:
Matches_home.columns=['team_id','goals_for','goals_against','points']
Matches_away.columns=['team_id','goals_for','goals_against','points']

In [77]:
Matches1=pd.concat([Matches_home, Matches_away])
Matches2 = Matches1.merge(Teams, how='inner', on='team_id').groupby(['team_name']).\
agg({'goals_for':['count','sum'],'goals_against':'sum','points':'sum'})\
.reset_index()

In [79]:
Matches2.columns=['team_name','matches_played', 'goals_for','goals_against','points']

In [81]:
Matches1

   team_id  goals_for  goals_against  points
0        1          0              1       0
1        1          3              3       1
2        4          5              2       3
3        6          0              0       1
0        4          1              0       3
1        6          3              3       1
2        1          2              5       0
3        1          0              0       1

In [80]:
Matches2['goal_diff']=Matches2['goals_for']-Matches2['goals_against']
Matches2.sort_values(['points','goal_diff','team_name'], ascending=[False, False, True])

  team_name  matches_played  goals_for  goals_against  points  goal_diff
2  Dortmund               2          6              2       6          4
1   Arsenal               2          3              3       2          0
0      Ajax               4          5              9       2         -4

# 614. Second Degree Follower

In [82]:
follow = pd.DataFrame([["A", "B"], ["B", "C"], ["B", "D"], ["D", "E"]], columns = ["followee","follower"])

In [93]:
follow.merge(follow,how='left', left_on='follower', right_on='followee').\
groupby('follower_x').filter(lambda x: x['follower_y'].nunique()>=1).groupby('follower_x')\
['follower_y'].nunique().reset_index().rename(columns={'follower_x':'follower','follower_y':'num'})

  follower  num
0        B    2
1        D    1

# 1174. Immediate Food Delivery II

In [104]:
Delivery = pd.DataFrame([[1,1,"2019-08-01","2019-08-02"],[2,2,"2019-08-02","2019-08-02"],\
                     [3,1,"2019-08-11","2019-08-12"],[4,3,"2019-08-24","2019-08-24"],\
                     [5,3,"2019-08-21","2019-08-22"],[6,2,"2019-08-11","2019-08-13"],\
                     [7,4,"2019-08-09","2019-08-09"]],\
                    columns = ["delivery_id","customer_id","order_date","customer_pref_delivery_date"])
Delivery['order_date']=pd.to_datetime(Delivery['order_date'])

Delivery['customer_pref_delivery_date']=pd.to_datetime(Delivery['customer_pref_delivery_date'])

In [105]:
Delivery

   delivery_id  customer_id order_date customer_pref_delivery_date
0            1            1 2019-08-01                  2019-08-02
1            2            2 2019-08-02                  2019-08-02
2            3            1 2019-08-11                  2019-08-12
3            4            3 2019-08-24                  2019-08-24
4            5            3 2019-08-21                  2019-08-22
5            6            2 2019-08-11                  2019-08-13
6            7            4 2019-08-09                  2019-08-09

In [106]:
Delivery.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
delivery_id                    7 non-null int64
customer_id                    7 non-null int64
order_date                     7 non-null datetime64[ns]
customer_pref_delivery_date    7 non-null datetime64[ns]
dtypes: datetime64[ns](2), int64(2)
memory usage: 352.0 bytes

In [117]:
Delivery['rank'] = Delivery.groupby('customer_id')['order_date'].rank(method ='dense', ascending=True)
(np.where(Delivery.query('rank==1')['order_date']==Delivery.query('rank==1')['customer_pref_delivery_date'],1,0)\
.sum()*100/Delivery.query('rank==1')['order_date'].count()).round(2)

50.0

In [114]:
Delivery.query('rank==1').count()

delivery_id                    4
customer_id                    4
order_date                     4
customer_pref_delivery_date    4
rank                           4
dtype: int64

# 1204. Last Person to Fit in the Bus

In [118]:
Queue = pd.DataFrame([[5,"Alice",250,1],[4,"Bob",175,5],[3,"Alex",350,2],[6,"John Cena",400,3],\
                      [1,"Winston",500,6],[2,"Marie",200,4]], columns = ["person_id","person_name","weight","turn"])

In [124]:
Queue['cum_sum'] = Queue.sort_values('turn', ascending=True)['weight'].cumsum()
Queue.query('cum_sum<=1000').nlargest(1,'cum_sum')['person_name']

3    John Cena
Name: person_name, dtype: object

# 1308. Running Total for Different Genders  2021/9/22

In [131]:
Scores = pd.DataFrame([["Aron","F","2020-01-01",17],["Alice","F","2020-01-07",23],["Bajrang","M","2020-01-07",7],\
["Khali","M","2019-12-25",11],["Slaman","M","2019-12-30",13],["Joe","M","2019-12-31",3],["Jose","M","2019-12-18",2],\
    ["Priya","F","2019-12-31",23],["Priyanka","F","2019-12-30",17]],\
                      columns=["player_name","gender","day","score_points"])

In [132]:
Scores.sort_values(['gender','day'], inplace=True)
Scores['total'] = Scores.groupby('gender')['score_points'].cumsum()
Scores[["gender","day","total"]]

  gender         day  total
8      F  2019-12-30     17
7      F  2019-12-31     40
0      F  2020-01-01     57
1      F  2020-01-07     80
6      M  2019-12-18      2
3      M  2019-12-25     13
4      M  2019-12-30     26
5      M  2019-12-31     29
2      M  2020-01-07     36

# 1336. Number of Transactions per Visit

In [133]:
Visits = pd.DataFrame([[1,"2020-01-01"],[2,"2020-01-02"],[12,"2020-01-01"],[19,"2020-01-03"],[1,"2020-01-02"],\
                   [2,"2020-01-03"],[1,"2020-01-04"],[7,"2020-01-11"],[9,"2020-01-25"],[8,"2020-01-28"]],
                     columns = ["user_id","visit_date"])

Transactions = pd.DataFrame([[1,"2020-01-02",120],[2,"2020-01-03",22],[7,"2020-01-11",232],[1,"2020-01-04",7],\
                         [9,"2020-01-25",33],[9,"2020-01-25",66],[8,"2020-01-28",1],[9,"2020-01-25",99]],\
                        columns = ["user_id","transaction_date","amount"])

In [134]:
df1 = Transactions.groupby(["user_id","transaction_date"])["amount"].count().reset_index(name='transactions_count')
df1

   user_id transaction_date  transactions_count
0        1       2020-01-02                   1
1        1       2020-01-04                   1
2        2       2020-01-03                   1
3        7       2020-01-11                   1
4        8       2020-01-28                   1
5        9       2020-01-25                   3

In [140]:
df2 = pd.DataFrame(range(0, max(df1['transactions_count'])+1))
df2.columns = ['transactions_count']

In [141]:
df3 = Visits.merge(df1, how='left',left_on=['user_id','visit_date'], right_on=['user_id','transaction_date']).fillna(0)

In [143]:
df2.merge(df3, how='left', on='transactions_count').groupby(['transactions_count'])['user_id'].count().\
reset_index(name='visits_count')

   transactions_count  visits_count
0                   0             4
1                   1             5
2                   2             0
3                   3             1

# 1613. Find the Missing IDs

In [144]:
Customers = pd.DataFrame([[1, "Alice"], [4, "Bob"], [5, "Charlie"]], columns = ["customer_id", "customer_name"])

In [146]:
df1= pd.DataFrame(range(1, max(Customers['customer_id'])))
df1.columns = ['ids']
df1

   ids
0    1
1    2
2    3
3    4

In [151]:
df1.merge(Customers, how='left',left_on='ids', right_on='customer_id').query("customer_id.isnull()")['ids']

1    2
2    3
Name: ids, dtype: int64

# 1285. Find the Start and End Number of Continuous Ranges

In [ ]:
{"headers":{"Logs":["log_id"]},"rows":{"Logs":[[1],[2],[3],[7],[8],[10]]}}

In [155]:
Logs = pd.DataFrame([[1],[2],[3],[7],[8],[10]], columns = ["log_id"])

In [156]:
Logs['rnk'] = Logs['log_id'].rank(method ='dense', ascending = True)
Logs['dif']=Logs['log_id'] - Logs['rnk']
df1 = Logs.groupby(['dif']).agg({'log_id':['min','max']}).reset_index()

df1.columns = ['dif','start_id','end_id']
df1[['start_id','end_id']]

   start_id  end_id
0         1       3
1         7       8
2        10      10

# 197. Rising Temperature

In [157]:
Weather = pd.DataFrame([[1, "2015-01-01", 10], [2, "2015-01-02", 25], [3, "2015-01-03", 20], [4, "2015-01-04", 30]],\
                      columns = ["Id", "RecordDate", "Temperature"])

In [158]:
Weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Id             4 non-null int64
RecordDate     4 non-null object
Temperature    4 non-null int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [165]:
from datetime import datetime, timedelta
Weather["RecordDate"] = pd.to_datetime(Weather["RecordDate"])
Weather['prev'] = Weather["RecordDate"]+timedelta(days=1)
Weather.sort_values
Weather

   Id RecordDate  Temperature       prev
0   1 2015-01-01           10 2015-01-02
1   2 2015-01-02           25 2015-01-03
2   3 2015-01-03           20 2015-01-04
3   4 2015-01-04           30 2015-01-05

In [166]:
Weather.merge(Weather, how='left', left_on='RecordDate', right_on='prev').query("Temperature_x>Temperature_y")['Id_x']

1    2
3    4
Name: Id_x, dtype: int64

# 1783. Grand Slam Titles 2021/9/24

In [167]:
Players = pd.DataFrame([[1, "Nadal"], [2, "Federer"], [3, "Novak"]], columns = ["player_id", "player_name"])
Championships = pd.DataFrame([[2018, 1, 1, 1, 1], [2019, 1, 1, 2, 2], [2020, 2, 1, 2, 2]],\
                             columns = ["year", "Wimbledon", "Fr_open", "US_open", "Au_open"])

In [170]:
# wide to long
df1 = Championships.melt(id_vars='year').\
rename(columns={'year':'year', 'variable': 'game' , 'value':'player_id'})

df1.merge(Players, how='inner', on='player_id').groupby(['player_id','player_name'])['game'].\
count().reset_index(name='grand_slams_count')

   player_id player_name  grand_slams_count
0          1       Nadal                  7
1          2     Federer                  5

# 1350. Students With Invalid Departments

In [172]:
Departments = pd.DataFrame([[1,"Electrical Engineering"],[7,"Computer Engineering"],[13,"Bussiness Administration"]],\
                          columns = ["id","name"])

Students = pd.DataFrame([[23,"Alice",1],[1,"Bob",7],[5,"Jennifer",13],[2,"John",14],\
[4,"Jasmine",77],[3,"Steve",74],[6,"Luis",1],[8,"Jonathan",7],[7,"Daiana",33],[11,"Madelynn",1]],\
                       columns = ["id","name","department_id"])

In [174]:
Students.merge(Departments, how='left', left_on='department_id', right_on='id').query('id_y.isnull()')\
[['id_x','name_x']].rename(columns={'id_x':'id','name_x':'name'})

   id     name
3   2     John
4   4  Jasmine
5   3    Steve
8   7   Daiana

# 595. Big Countries

In [175]:
World = pd.DataFrame([["Afghanistan", "Asia", 652230, 25500100, 20343000000],\
                    ["Albania", "Europe", 28748, 2831741, 12960000000],\
                    ["Algeria", "Africa", 2381741, 37100000, 188681000000],\
                    ["Andorra", "Europe", 468, 78115, 3712000000],\
                    ["Angola", "Africa", 1246700, 20609294, 100990000000]],\
                    columns = ["name", "continent",	"area",	"population", "gdp"])

In [177]:
World.query("population > 25000000 | area >3000000")[['name','population','area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

# 1070. Product Sales Analysis III

In [181]:
Product = pd.DataFrame([[100,"Nokia"],[200,"Apple"],[300,"Samsung"]], columns =["product_id","product_name"] )
Sales = pd.DataFrame([[1,100,2008,10,5000],[2,100,2009,12,5000],[7,200,2011,15,9000]],\
                    columns = ["sale_id","product_id","year","quantity","price"])

In [182]:
Sales['rnk'] = Sales.groupby('product_id')['year'].rank(method='dense', ascending =True)
Sales.query('rnk==1').merge(Product, how='inner', on='product_id')[['product_id','year','quantity','price']].\
rename(columns = {'product_id':'product_id','year':'first_year','quantity':'quantity','price':'price'})

   product_id  first_year  quantity  price
0         100        2008        10   5000
1         200        2011        15   9000

# 1949. Strong Friendship DIfficult

In [188]:
Friendship= pd.DataFrame([[1,2],[1,3],[2,3],[1,4],[2,4],[1,5],[2,5],[1,7],[3,7],[1,6],[3,6],[2,6]],\
                        columns = ["user1_id","user2_id"])
Friendship

    user1_id  user2_id
0          1         2
1          1         3
2          2         3
3          1         4
4          2         4
5          1         5
6          2         5
7          1         7
8          3         7
9          1         6
10         3         6
11         2         6

In [186]:
Friendship2= Friendship[["user2_id","user1_id"]].rename(columns = {"user2_id":"user1_id","user1_id":"user2_id"})
#Friendship2

In [197]:
df = pd.concat([Friendship,Friendship2])

df.merge(df, how='left', left_on='user2_id',right_on='user1_id').query('user1_id_x<user2_id_y').\
merge(Friendship, how='inner',left_on='user1_id_x',right_on='user1_id').query('user2_id_y==user2_id').\
groupby(['user1_id_x','user2_id_y']).filter(lambda x: x['user1_id'].count()>=3).\
groupby(['user1_id_x','user2_id_y'])['user1_id'].count().reset_index()\
.rename(columns = {'user1_id_x':'user1_id','user2_id_y':'user2_id','user1_id':'common_friend'})

   user1_id  user2_id  common_friend
0         1         2              4
1         1         3              3

# 1264. Page Recommendations

In [198]:
Friendship=pd.DataFrame([[1,2],[1,3],[1,4],[2,3],[2,4],[2,5],[6,1]], columns = ["user1_id","user2_id"])
Likes = pd.DataFrame([[1,88],[2,23],[3,24],[4,56],[5,11],[6,33],[2,77],[3,77],[6,88]],\
                    columns = ["user_id","page_id"])

In [214]:
Friendship2 = Friendship[["user2_id","user1_id"]].rename(columns = {"user2_id":"user1_id","user1_id":"user2_id"})
Friendship3 = pd.concat([Friendship,Friendship2])


df = Friendship3.merge(Likes, how='inner', left_on='user1_id',right_on='user_id').query("user2_id==1")

likes_by1 = list(Likes.query("user_id == 1")['page_id'])
df[~df['page_id'].isin(likes_by1)]['page_id'].unique()

array([23, 77, 33, 24, 56])

# 1843. Suspicious Bank Accounts

In [216]:
Transactions['day']=pd.to_datetime(Transactions['day'])
Transactions.head()

   transaction_id  account_id      type  amount                 day
0               2           3  Creditor  107100 2021-06-02 11:38:14
1               4           4  Creditor   10400 2021-06-20 12:39:18
2              11           4    Debtor   58800 2021-07-23 12:41:55
3               1           4  Creditor   49300 2021-05-03 16:11:04
4              15           3    Debtor   75500 2021-05-23 14:40:20

In [219]:
Transactions['month'] = Transactions['day'].dt.to_period('M')

In [236]:
df = Transactions.query('type=="Creditor"').groupby(['account_id','month'])['amount'].sum().reset_index().\
merge(Accounts,how='inner', on='account_id').query("amount>max_income")

df.merge(df, how='inner', on='account_id').query("(month_x.dt.month-month_y.dt.month)==1")['account_id'].unique()

array([3])

In [232]:
df.merge(df, how='inner', on='account_id')['month_x'].dt.month

0    6
1    6
2    7
3    7
4    5
5    5
6    7
7    7
Name: month_x, dtype: int64

In [231]:
np.timedelta64(3, 'M')

numpy.timedelta64(3,'M')

# 1757. Recyclable and Low Fat Products

In [239]:
Products = pd.DataFrame([["0","Y","N"],["1","Y","Y"],["2","N","Y"],["3","Y","Y"],["4","N","N"]],\
                       columns = ["product_id","low_fats","recyclable"])

In [240]:
Products.query("low_fats=='Y' & recyclable=='Y'")['product_id']

1    1
3    3
Name: product_id, dtype: object

# 1633. Percentage of Users Attended a Contest

In [241]:
Users = pd.DataFrame([[6,"Alice"],[2,"Bob"],[7,"Alex"]], columns = ["user_id","user_name"])
Register = pd.DataFrame([[215,6],[209,2],[208,2],[210,6],[208,6],[209,7],[209,6],[215,7],[208,7],[210,2],\
   [207,2],[210,7]], columns = ["contest_id","user_id"])

In [244]:
df = Register.groupby('contest_id')['user_id'].count().reset_index(name='cnt')
df['percentage']= df['cnt']*100/Users['user_id'].count().round(2)
df[['contest_id','percentage']].sort_values(['percentage','contest_id'], ascending=[False, True])

   contest_id  percentage
1         208  100.000000
2         209  100.000000
3         210  100.000000
4         215   66.666667
0         207   33.333333

# 1211. Queries Quality and Percentage

In [ ]:
{"headers":{"Queries":["query_name","result","position","rating"]},
 "rows":{"Queries":[["Dog","Golden Retriever",1,5],["Dog","German Shepherd",2,5],["Dog","Mule",200,1],
                    ["Cat","Shirazi",5,2],["Cat","Siamese",3,3],["Cat","Sphynx",7,4]]}}

In [258]:
Queries = pd.DataFrame([["Dog","Golden Retriever",1,5],["Dog","German Shepherd",2,5],["Dog","Mule",200,1],\
                    ["Cat","Shirazi",5,2],["Cat","Siamese",3,3],["Cat","Sphynx",7,4]],\
                       columns = ["query_name","result","position","rating"])

In [259]:
Queries['quality']=Queries['rating']/Queries['position']


df1 = Queries.groupby('query_name').agg({'quality':['mean','count']}).reset_index().round(2)
df1.columns =['query_name','quality','total']
df1

  query_name  quality  total
0        Cat     0.66      3
1        Dog     2.50      3

In [260]:
df2 = Queries.query('rating<3').groupby('query_name')['quality'].count().reset_index(name='cnt')

In [262]:
df3 = df1.merge(df2, how='left',on='query_name')
df3['poor_query_percentage']=(df3['cnt']/df3['total']*100).round(2)
df3[['query_name','quality','poor_query_percentage']]

  query_name  quality  poor_query_percentage
0        Cat     0.66                  33.33
1        Dog     2.50                  33.33

# 1511. Customer Order Frequency 2021/9/27

In [1]:
import pandas as pd
import numpy as np

In [2]:
Customers = pd.DataFrame( [[1, "Winston", "USA"], [2, "Jonathan", "Peru"],[3, "Moustafa", "Egypt"]],\
                        columns = ["customer_id", "name", "country"])
Product = pd.DataFrame([[10, "LC Phone", 300], [20, "LC T-Shirt", 10], [30, "LC Book", 45], [40, "LC Keychain", 2]],\
                      columns = ["product_id", "description", "price"])
Orders = pd.DataFrame([[1, 1, 10, "2020-06-10", 1], [2, 1, 20, "2020-07-01", 1],[3, 1, 30, "2020-07-08", 2],\
[4, 2, 10, "2020-06-15", 2], [5, 2, 40, "2020-07-01", 10], [6, 3, 20, "2020-06-24", 2],\
                       [7, 3, 30, "2020-06-25", 2], [9, 3, 30, "2020-05-08", 3]],\
                     columns = ["order_id", "customer_id", "product_id", "order_date","quantity"])

In [35]:
Orders['order_date']=pd.to_datetime(Orders['order_date'])
df1 = Orders.query("order_date.dt.year==2020 & order_date.dt.month.isin([6,7])")\
.merge(Product, how='inner',on='product_id')
df1['sales']= df1['price']*df1['quantity']
df1['month']=df1['order_date'].dt.month


df1.groupby(['month','customer_id']).filter(lambda x: (x['sales'].sum()>=100) ).\
merge(Customers, how='inner', on='customer_id').groupby('customer_id').filter(lambda x: (x['month'].nunique()==2))\
[['customer_id','name']].drop_duplicates()

   customer_id     name
0            1  Winston

# 1495. Friendly Movies Streamed Last Month

In [36]:
TVProgram = pd.DataFrame([["2020-06-10 08:00", 1, "LC-Channel"], ["2020-05-11 12:00", 2, "LC-Channel"],\
                        ["2020-05-12 12:00", 3, "LC-Channel"], ["2020-05-13 14:00", 4, "Disney Ch"],\
                    ["2020-06-18 14:00", 4, "Disney Ch"], ["2020-07-15 16:00", 5, "Disney Ch"]],\
                        columns = ["program_date", "content_id", "channel"])
Content = pd.DataFrame([[1, "Leetcode Movie", "N", "Movies"], [2, "Alg. for Kids", "Y", "Series"],\
            [3, "Database Sols", "N", "Series"], [4, "Aladdin", "Y", "Movies"], [5, "Cinderella", "Y", "Movies"]],\
                      columns = ["content_id", "title", "Kids_content", "content_type"])

In [37]:
TVProgram["program_date"]=pd.to_datetime(TVProgram["program_date"])

TVProgram.merge(Content,how='inner', on='content_id').query("(Kids_content=='Y')&(content_type=='Movies')\
& (program_date.dt.year==2020)& (program_date.dt.month==6)")['title'].drop_duplicates()

4    Aladdin
Name: title, dtype: object

# 1677. Product's Worth Over Invoices

In [ ]:
{"headers":{"Product":["product_id","name"],"Invoice":["invoice_id","product_id","rest","paid","canceled","refunded"]}
 ,"rows":{"Product":[[0,"ham"],[1,"bacon"]],
          "Invoice":[[23,0,2,0,5,0],[12,0,0,4,0,3],[1,1,1,1,0,1],[2,1,1,0,1,1],[3,1,0,1,1,1],[4,1,1,1,1,0]]}}

In [39]:
Product = pd.DataFrame([[0,"ham"],[1,"bacon"]],columns = ["product_id","name"])
Invoice = pd.DataFrame([[23,0,2,0,5,0],[12,0,0,4,0,3],[1,1,1,1,0,1],[2,1,1,0,1,1],[3,1,0,1,1,1],[4,1,1,1,1,0]],\
                      columns = ["invoice_id","product_id","rest","paid","canceled","refunded"])

In [44]:
Product.merge(Invoice.groupby('product_id')["rest","paid","canceled","refunded"].sum().reset_index(),\
              how='left',on='product_id').fillna(0).drop('product_id',axis=1).sort_values('name', ascending=True)

    name  rest  paid  canceled  refunded
1  bacon     3     3         3         3
0    ham     2     4         5         3

# 1821. Find Customers With Positive Revenue this Year

In [55]:
Customers = pd.DataFrame([["1","2018","50"],["1","2021","30"],["1","2020","70"],\
                      ["2","2021","-50"],["3","2018","10"],["3","2016","50"],["4","2021","20"]],\
                        columns = ["customer_id","year","revenue"])

In [56]:
Customers['year']=Customers['year'].astype("int64")
Customers['revenue']=Customers['revenue'].astype("int64")
Customers.query('year==2021').groupby('customer_id').filter(lambda x: x['revenue'].sum()>0)['customer_id'].drop_duplicates()

1    1
6    4
Name: customer_id, dtype: object

# 1731. The Number of Employees Which Report to Each Employee

In [62]:
Employees=pd.DataFrame([[9,"Hercy",np.nan,43],[6,"Alice",9,41],[4,"Bob",9,36],[2,"Winston",np.nan,37]],\
                      columns=["employee_id","name","reports_to","age"])

In [74]:
df = Employees.merge(Employees, how='inner',left_on='reports_to',right_on='employee_id')\
.groupby(['reports_to_x','name_y']).agg({'employee_id_x':'nunique','age_x':'mean'}).round().reset_index()
df.columns = ["employee_id","name","reports_count","average_age"]
df

   employee_id   name  reports_count  average_age
0          9.0  Hercy              2         38.0

# 196. Delete Duplicate Emails

In [77]:
Person = pd.DataFrame([[1, "john@example.com"], [2, "bob@example.com"], [3, "john@example.com"]],\
                     columns = ["Id", "Email"])

In [82]:
Person['rnk'] = Person.groupby(['Email']).rank(method='dense',ascending=True)
Person.query('rnk==1')[['Id','Email']]

   Id             Email
0   1  john@example.com
1   2   bob@example.com

# 1241. Number of Comments per Post

In [83]:
Submissions = pd.DataFrame([[1,'null'],[2,'null'],[1,'null'],[12,'null'],[3,1],[5,2],[3,1],[4,1],[9,1],[10,2],[6,7]],
                          columns =["sub_id","parent_id"] )

In [85]:
df = Submissions.query('parent_id =="null"').merge(Submissions, how='left',left_on='sub_id', right_on='parent_id')\
.groupby('sub_id_x')['sub_id_y'].nunique().reset_index().sort_values('sub_id_x',ascending=True)

df.columns = ['post_id', 'number_of_comments']
df

   post_id  number_of_comments
0        1                   3
1        2                   2
2       12                   0

# 1587. Bank Account Summary II 2021/9/28

In [88]:
Users=pd.DataFrame([[900001, "Alice"], [900002, "Bob"], [900003, "Charlie"]], columns = ["account", "name"])
Transactions = pd.DataFrame([[1, 900001, 7000, "2020-08-01"], [2, 900001, 7000, "2020-09-01"],\
                             [3, 900001, -3000, "2020-09-02"],[4, 900002, 1000, "2020-09-12"],\
                             [5, 900003, 6000, "2020-08-07"], [6, 900003, 6000, "2020-09-07"],\
          [7, 900003, -4000, "2020-09-11"]], columns = ["trans_id", "account", "amount", "transacted_on"])

In [90]:
Transactions.groupby('account')['amount'].sum().reset_index(name='balance').merge(Users, how='inner', on='account')\
.query('balance>10000')[['name','balance']]

    name  balance
0  Alice    11000

# 1378. Replace Employee ID With The Unique Identifier

In [91]:
Employees = pd.DataFrame([[1,"Alice"],[7,"Bob"],[11,"Meir"],[90,"Winston"],[3,"Jonathan"]],\
                         columns = ["id","name"])
EmployeeUNI = pd.DataFrame([[3,1],[11,2],[90,3]], columns = ["id","unique_id"])

In [92]:
Employees.merge(EmployeeUNI, how='left', on='id')[['unique_id','name']]

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

# 1280. Students and Examinations

In [93]:
Students = pd.DataFrame([[1,"Alice"],[2,"Bob"],[13,"John"],[6,"Alex"]],columns = ["student_id","student_name"])
Subjects = pd.DataFrame([["Math"],["Physics"],["Programming"]], columns = ["subject_name"])
Examinations = pd.DataFrame([[1,"Math"],[1,"Physics"],[1,"Programming"],[2,"Programming"],[1,"Physics"],[1,"Math"],\
        [13,"Math"],[13,"Programming"],[13,"Physics"],[2,"Math"],[1,"Math"]],\
                           columns = ["student_id","subject_name"])

In [97]:
Examinations.columns =["student_id_x","subject_name_x"]

In [99]:
Students['tmp']=1
Subjects['tmp']=1
Students.merge(Subjects, how='outer', on='tmp').merge(Examinations, how='left',\
left_on=["student_id","subject_name"], right_on=["student_id_x","subject_name_x"])\
.groupby(["student_id","student_name","subject_name"])['subject_name_x'].count().reset_index(name='attended_exams').\
fillna(0).sort_values(["student_id","subject_name"],ascending=[True, True])

    student_id student_name subject_name  attended_exams
0            1        Alice         Math               3
1            1        Alice      Physics               2
2            1        Alice  Programming               1
3            2          Bob         Math               1
4            2          Bob      Physics               0
5            2          Bob  Programming               1
6            6         Alex         Math               0
7            6         Alex      Physics               0
8            6         Alex  Programming               0
9           13         John         Math               1
10          13         John      Physics               1
11          13         John  Programming               1

# 596. Classes More Than 5 Students

In [100]:
courses = pd.DataFrame([["A", "Math"], ["B", "English"], ["C", "Math"],["D", "Biology"], ["E", "Math"],\
["F", "Computer"], ["G", "Math"], ["H", "Math"], ["I", "Math"]], columns = ["student", "class"])

In [102]:
courses.groupby('class').filter(lambda x: x['student'].count()>=5)['class'].drop_duplicates()

0    Math
Name: class, dtype: object

# 577. Employee Bonus

In [106]:
Employee = pd.DataFrame([[3, "Brad", np.nan, 4000], [1, "John", 3, 1000],[2, "Dan", 3, 2000], [4, "Thomas", 3, 4000]],\
                       columns = ["EmpId", "Name", "Supervisor", "Salary"])
Bonus = pd.DataFrame([[2, 500], [4, 2000]], columns = ["EmpId", "Bonus"])

In [109]:
Employee.merge(Bonus, how='left',on='EmpId').fillna(0).query("Bonus<1000")[['EmpId','Bonus']].replace(0, np.nan)

   EmpId  Bonus
0      3    NaN
1      1    NaN
2      2  500.0

# 1543. Fix Product Name Format

In [123]:
Sales = pd.DataFrame([[1, "LCPHONE", "2000-01-16"],[2, "LCPhone", "2000-01-17"], [3, "LcPhOnE", "2000-02-18"],\
[4, "LCKeyCHAiN", "2000-02-19"],[5, " LCKeyChain", "2000-02-28"], [6, " Matryoshka ", "2000-03-31"]],\
                    columns = ["sale_id", "product_name", "sale_date"])
Sales['sale_date'] = pd.to_datetime(Sales['sale_date'])

In [124]:
Sales['sale_date'] = Sales['sale_date'].dt.to_period('M')
Sales['product_name'] = Sales['product_name'].str.lower().str.strip()
Sales.groupby(['product_name','sale_date'])['sale_id'].count().reset_index(name='total')\
.sort_values(['product_name','sale_date'], ascending=[True, True])

  product_name sale_date  total
0   lckeychain   2000-02      2
1      lcphone   2000-01      2
2      lcphone   2000-02      1
3   matryoshka   2000-03      1

# 1890. The Latest Login in 2020

In [127]:
Logins = pd.DataFrame([[6, "2020-06-30 15:06:07"], [6, "2021-04-21 14:06:06"],\
                     [6, "2019-03-07 00:18:15"], [8, "2020-02-01 05:10:53"],\
                     [8, "2020-12-30 00:46:50"], [2, "2020-01-16 02:49:50"],\
                     [2, "2019-08-25 07:59:08"], [14, "2019-07-14 09:00:00"],\
                     [14, "2021-01-06 11:59:59"]], columns = ["user_id", "time_stamp"])
Logins['time_stamp']= pd.to_datetime(Logins['time_stamp'])

In [128]:
df = Logins.query("time_stamp.dt.year==2020")
df['rnk']= df.groupby('user_id')["time_stamp"].rank(method='dense', ascending=False)
df.query("rnk==1")[["user_id", "time_stamp"]].rename(columns = {"user_id":"user_id", "time_stamp":"last_stamp"})

/Users/wentinggao/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   user_id          last_stamp
0        6 2020-06-30 15:06:07
4        8 2020-12-30 00:46:50
5        2 2020-01-16 02:49:50

# 1873. Calculate Special Bonus

In [129]:
Employees = pd.DataFrame([[2,"Meir",3000],[3,"Michael",3800],[7,"Addilyn",7400],[8,"Juan",6100],[9,"Kannon",7700]],\
                        columns = ["employee_id","name","salary"])

In [135]:
df = Employees.query('(employee_id%2==1) & (name.str[0]!="M")')[["employee_id","salary"]]
df.columns = ['employee_id','bonus']

In [136]:
Employees.merge(df, how='left', on='employee_id')[['employee_id','bonus']].fillna(0)\
.sort_values('employee_id', ascending=True)

   employee_id   bonus
0            2     0.0
1            3     0.0
2            7  7400.0
3            8     0.0
4            9  7700.0

# 1113. Reported Posts

In [140]:
Actions = pd.DataFrame([[1,1,"2019-07-01","view",np.nan],[1,1,"2019-07-01","like",np.nan],\
[1,1,"2019-07-01","share",np.nan],[2,4,"2019-07-04","view",np.nan],[2,4,"2019-07-04","report","spam"],\
[3,4,"2019-07-04","view",np.nan],[3,4,"2019-07-04","report","spam"],[4,3,"2019-07-02","view",np.nan],\
[4,3,"2019-07-02","report","spam"],[5,2,"2019-07-04","view",np.nan],[5,2,"2019-07-04","report","racism"],\
[5,5,"2019-07-04","view",np.nan],[5,5,"2019-07-04","report","racism"]],\
                      columns = ["user_id","post_id","action_date","action","extra"])

In [142]:
Actions['action_date'] = pd.to_datetime(Actions['action_date'])

Actions.query("(action=='report') & (action_date=='2019-07-04')").groupby('extra')['post_id'].nunique().reset_index()\
.rename(columns = {'extra':'report_reason','post_id':'report_count'})

  report_reason  report_count
0        racism             2
1          spam             1

# 1667. Fix Names in a Table

In [143]:
Users = pd.DataFrame([[1,"aLice"],[2,"bOB"]], columns = ["user_id","name"])

In [151]:
Users['name'] = Users['name'].str.capitalize()
Users

   user_id   name
0        1  Alice
1        2    Bob

# 182. Duplicate Emails  2021/9/30

In [152]:
Person = pd.DataFrame([[1, "a@b.com"], [2, "c@d.com"], [3, "a@b.com"]], columns = ["Id", "Email"])

In [153]:
Person.groupby('Email').filter(lambda x: x['Id'].count()>1)['Email'].drop_duplicates()

0    a@b.com
Name: Email, dtype: object

# 1978. Employees Whose Manager Left the Company

In [154]:
Employees = pd.DataFrame([[3, "Mila", 9, 60301], [12, "Antonella", np.nan, 31000], [13, "Emery", np.nan, 67084],\
                        [1, "Kalel", 11, 21241], [9, "Mikaela", np.nan, 50937], [11, "Joziah", 6, 28485]],\
                        columns = ["employee_id", "name", "manager_id", "salary"])

In [158]:
Employees.query("(salary<30000) & (manager_id.notna())").merge(Employees, how='left', left_on='manager_id',\
right_on = 'employee_id').query('employee_id_y.isnull()')['employee_id_x'].rename(columns={'employee_id_x':'employee_id'})

1    11
dtype: int64

# 1965. Employees With Missing Information

In [159]:
Employees = pd.DataFrame([[2,"Crew"],[4,"Haven"],[5,"Kristian"]], columns = ["employee_id","name"])
Salaries = pd.DataFrame([[5,76071],[1,22517],[4,63539]],columns = ["employee_id","salary"])

In [169]:
pd.DataFrame(pd.concat([Employees['employee_id'],Salaries['employee_id']]).drop_duplicates()).\
merge(Employees, how='left', on='employee_id').merge(Salaries, how='left', on='employee_id')\
.query("(name.isnull()) |(salary.isnull())")[['employee_id']].sort_values('employee_id', ascending=True)

   employee_id
3            1
0            2

In [163]:
pd.DataFrame(pd.concat([Employees['employee_id'],Salaries['employee_id']]).drop_duplicates())

   employee_id
0            2
1            4
2            5
1            1

# 1693. Daily Leads and Partners

In [170]:
DailySales = pd.DataFrame([["2020-12-8","toyota",0,1],["2020-12-8","toyota",1,0],["2020-12-8","toyota",1,2],\
                           ["2020-12-7","toyota",0,2],["2020-12-7","toyota",0,1],["2020-12-8","honda",1,2],\
                           ["2020-12-8","honda",2,1],["2020-12-7","honda",0,1],["2020-12-7","honda",1,2],\
                           ["2020-12-7","honda",2,1]],\
                         columns = ["date_id","make_name","lead_id","partner_id"])

In [172]:
DailySales.groupby(["date_id","make_name"])["lead_id","partner_id"].nunique().reset_index().\
rename(columns = {'date_id':'date_id','make_name':'make_name','lead_id':'unique_leads',\
                 'partner_id':'unique_partners'})

     date_id make_name  unique_leads  unique_partners
0  2020-12-7     honda             3                2
1  2020-12-7    toyota             1                2
2  2020-12-8     honda             2                2
3  2020-12-8    toyota             2                3

# 1939. Users That Actively Request Confirmation Messages

In [175]:
Confirmations = pd.DataFrame([[3, "2021-01-06 03:30:46", "timeout"], [3, "2021-01-06 03:37:45", "timeout"],\
        [7, "2021-06-12 11:57:29", "confirmed"], [7, "2021-06-13 11:57:30", "confirmed"],\
                      [2, "2021-01-22 00:00:00", "confirmed"], [2, "2021-01-23 00:00:00", "timeout"],\
[6, "2021-10-23 14:14:14", "confirmed"], [6, "2021-10-24 14:14:13", "timeout"]],\
                            columns = ["user_id", "time_stamp", "action"])

In [176]:
Confirmations['time_stamp']=pd.to_datetime(Confirmations['time_stamp'])
Confirmations['prev_time']=Confirmations.groupby('user_id')['time_stamp'].shift()

In [193]:
diff = Confirmations['time_stamp']-Confirmations['prev_time']
days, seconds = diff.dt.days, diff.dt.seconds
Confirmations ['seconds'] = days * 24*60*60 + seconds

In [195]:
Confirmations.query('seconds<=86400')['user_id']

1    3
5    2
7    6
Name: user_id, dtype: int64

# 619. Biggest Single Number 2021/10/1

In [196]:
my_numbers= pd.DataFrame([[8],[8],[3],[3],[1],[4],[5],[6]], columns=["num"] )

In [198]:
my_numbers.groupby('num').filter(lambda x:x['num'].count()==1)['num'].max()

6

# 610. Triangle Judgement

In [199]:
triangle = pd.DataFrame([[13,15,30],[10,20,15]], columns = ["x","y","z"])

In [200]:
triangle['triangle']=np.where(((triangle['x']+triangle['y'])> triangle['z']) &\
                              ((triangle['z']+triangle['y'])> triangle['x'])&\
    ((triangle['x']+triangle['z'])> triangle['y']), 'Yes','No')

triangle

    x   y   z triangle
0  13  15  30       No
1  10  20  15      Yes

# 1623. All Valid Triplets That Can Represent a Country

In [201]:
SchoolA = pd.DataFrame([[1,"Alice"],[2,"Bob"]], columns = ["student_id","student_name"])
SchoolB = pd.DataFrame([[3,"Tom"]], columns = ["student_id","student_name"])
SchoolC = pd.DataFrame([[3,"Tom"],[2,"Jerry"],[10,"Alice"]], columns = ["student_id","student_name"])

In [202]:
SchoolA['tmp']=1
SchoolB['tmp']=1
SchoolC['tmp']=1

In [210]:
SchoolA.merge(SchoolB, how='outer', on='tmp').merge(SchoolC, how='outer', on='tmp')\
.query("(student_id_x != student_id_y)& (student_id != student_id_y)& (student_id_x != student_id)&\
(student_name_x != student_name_y)& (student_name_x != student_name)& (student_name != student_name_y)")\
[['student_name_x','student_name_y','student_name']]\
.rename(columns = {'student_name_x':'member_A', 'student_name_y':'member_B', 'student_name':'member_C'})

  member_A member_B member_C
1    Alice      Tom    Jerry
5      Bob      Tom    Alice

# 627. Swap Salary

In [211]:
salary = pd.DataFrame([[1,"A","m",2500],[2,"B","f",1500],[3,"C","m",5500],[4,"D","f",500]],\
                     columns = ["id","name","sex","salary"])

In [212]:
salary['sex'] = np.where(salary['sex']=='f','m','f')
salary

   id name sex  salary
0   1    A   f    2500
1   2    B   m    1500
2   3    C   f    5500
3   4    D   m     500

# 1327. List the Products Ordered in a Period

In [215]:
Products = pd.DataFrame([[1, "Leetcode Solutions", "Book"], [2, "Jewels of Stringology", "Book"],\
                       [3, "HP", "Laptop"], [4, "Lenovo", "Laptop"], [5, "Leetcode Kit", "T-shirt"]],\
                       columns = ["product_id", "product_name", "product_category"])


Orders = pd.DataFrame([[1, "2020-02-05", 60], [1, "2020-02-10", 70], [2, "2020-01-18", 30], [2, "2020-02-11", 80], 
                     [3, "2020-02-17", 2], [3, "2020-02-24", 3], [4, "2020-03-01", 20], [4, "2020-03-04", 30],
                     [4, "2020-03-04", 60], [5, "2020-02-25", 50], [5, "2020-02-27", 50], [5, "2020-03-01", 50]],\
                     columns = ["product_id", "order_date", "unit"])

In [216]:
Orders['order_date']=pd.to_datetime(Orders['order_date'])
Orders.query('(order_date.dt.month==2) & (order_date.dt.year==2020)').groupby('product_id').filter(lambda x: x['unit'].sum()>=100).\
groupby('product_id')['unit'].sum()\
.reset_index().merge(Products, how='inner', on='product_id')[['product_name','unit']]

         product_name  unit
0  Leetcode Solutions   130
1        Leetcode Kit   100

# 597. Friend Requests I: Overall Acceptance Rate 2021/10/1

In [217]:
FriendRequest=pd.DataFrame([[1,2,"2016/06/01"],[1,3,"2016/06/01"],[1,4,"2016/06/01"],[2,3,"2016/06/02"],\
[3,4,"2016/06/09"]], columns =["sender_id","send_to_id","request_date"])
RequestAccepted = pd.DataFrame([[1,2,"2016/06/03"],[1,3,"2016/06/08"],[2,3,"2016/06/08"],[3,4,"2016/06/09"],\
    [3,4,"2016/06/10"]], columns = ["requester_id","accepter_id","accept_date"])

In [218]:
FriendRequest["request_date"]=pd.to_datetime(FriendRequest["request_date"])
RequestAccepted["accept_date"]=pd.to_datetime(RequestAccepted["accept_date"])

In [224]:

FriendRequest["id"] = FriendRequest["sender_id"].astype(str)+FriendRequest["send_to_id"].astype(str)

RequestAccepted["id"] = RequestAccepted["requester_id"].astype(str)+RequestAccepted["accepter_id"].astype(str)

In [230]:
accept_rate = round(RequestAccepted["id"].nunique()/FriendRequest["id"].nunique(),2)
np.where(np.isnan(accept_rate), 0, accept_rate)

array(0.8)

# 1484. Group Sold Products By The Date

In [ ]:
{"headers":{"Activities":["sell_date","product"]},
 "rows":{"Activities":[["2020-05-30","Headphone"],["2020-06-01","Pencil"],["2020-06-02","Mask"],
    ["2020-05-30","Basketball"],["2020-06-01","Bible"],["2020-06-02","Mask"],["2020-05-30","T-Shirt"]]}}

In [232]:
Activities = pd.DataFrame([["2020-05-30","Headphone"],["2020-06-01","Pencil"],["2020-06-02","Mask"],\
    ["2020-05-30","Basketball"],["2020-06-01","Bible"],["2020-06-02","Mask"],["2020-05-30","T-Shirt"]],
                         columns = ["sell_date","product"])

In [249]:
Activities.sort_values(["sell_date","product"], ascending=[True, True], inplace=True)
df = Activities.groupby(['sell_date']).agg({'product': ['nunique',','.join]}).reset_index()
df.columns =['sell_date','num_sold','products']
df

    sell_date  num_sold                      products
0  2020-05-30         3  Basketball,Headphone,T-Shirt
1  2020-06-01         2                  Bible,Pencil
2  2020-06-02         1                     Mask,Mask

# 181. Employees Earning More Than Their Managers

In [1]:
import pandas as pd
import numpy as np
Employee = pd.DataFrame([[1, "Joe", 70000, 3], [2, "Henry", 80000, 4], [3, "Sam", 60000, np.nan],\
                       [4, "Max", 90000, np.nan]],columns = ["Id", "Name", "Salary", "ManagerId"])

In [3]:
Employee.merge(Employee, how='left',left_on='ManagerId',right_on='Id').query("Salary_x>Salary_y")['Name_x'].\
rename(columns={'Name_x':'Employee'})

0    Joe
dtype: object

# 1831. Maximum Transaction Each Day 2021/10/7

In [4]:
Transactions = pd.DataFrame([[8, "2021-4-3 15:57:28", 57], [9, "2021-4-28 08:47:25", 21],\
                             [1, "2021-4-29 13:28:30", 58],\
                           [5, "2021-4-28 16:39:59", 40], [6, "2021-4-29 23:39:28", 58]],\
                           columns = ["transaction_id", "day", "amount"])

In [9]:
Transactions['day'] = pd.to_datetime(Transactions['day'])
Transactions['dates'] = Transactions['day'].dt.date

In [12]:
Transactions['rnk']=Transactions.groupby(['dates'])['amount'].rank(method='dense',ascending=False)
Transactions.query("rnk==1")[['transaction_id']].sort_values('transaction_id',ascending=True)

   transaction_id
2               1
3               5
4               6
0               8

# 1867. Orders With Maximum Quantity Above Average

In [14]:
OrdersDetails = pd.DataFrame([[1 ,1, 12], [1 ,2, 10], [1 ,3, 15], [2 ,1, 8], [2 ,4, 4], [2 ,5, 6],\
        [3 , 3, 5], [3 ,4, 18], [4 ,5, 2], [4 ,6, 8], [5 ,7, 9], [5 ,8, 9], [3 ,9, 20], [2 ,9, 4]],\
                            columns = ["order_id", "product_id", "quantity"])

In [20]:
df = OrdersDetails.groupby('order_id').agg({"product_id":'nunique',"quantity":'sum'}).reset_index()
df['avg_q']=df['quantity']/df['product_id']

df2 = OrdersDetails.groupby('order_id')['quantity'].max().reset_index()
df2['max']=df['avg_q'].max()

In [23]:
df2.query('quantity>max')[['order_id']]

   order_id
0         1
2         3

# 176. Second Highest Salary 2021/11/7

In [2]:
import pandas as pd
import numpy as np
Employee = pd.DataFrame([[1,100],[2,200],[3,300]], columns = ["id","salary"])

In [5]:
Employee['rnk']=Employee['salary'].rank(method='dense',ascending=False)
Employee.query('rnk==2')[['salary']].rename(columns={'salary':'SecondHighestSalary'})

   SecondHighestSalary
1                  200

# 601. Human Traffic of Stadium

In [31]:
Stadium=pd.DataFrame([[1, "2017-01-01", 10], [2, "2017-01-02", 109],[3, "2017-01-03", 150],\
                      [4, "2017-01-04", 99], [5, "2017-01-05", 145], [6, "2017-01-06", 1455],\
                      [7, "2017-01-07", 199], [8, "2017-01-09", 188]],\
                    columns = ["id", "visit_date", "people"])

In [32]:
Stadium.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
id            8 non-null int64
visit_date    8 non-null object
people        8 non-null int64
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

In [33]:
import datetime
Stadium['visit_date']=pd.to_datetime(Stadium['visit_date'])

In [34]:
df = Stadium.query('people>=100')
df['cum_cnt'] = df.id.diff().gt(1).cumsum()
df

/Users/wentinggao/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   id visit_date  people  cum_cnt
1   2 2017-01-02     109        0
2   3 2017-01-03     150        0
4   5 2017-01-05     145        1
5   6 2017-01-06    1455        1
6   7 2017-01-07     199        1
7   8 2017-01-09     188        1

In [35]:
df.groupby(['cum_cnt']).filter(lambda x: x['cum_cnt'].count()>=3).drop('cum_cnt',axis=1).sort_values(by='visit_date')

   id visit_date  people
4   5 2017-01-05     145
5   6 2017-01-06    1455
6   7 2017-01-07     199
7   8 2017-01-09     188

# 1468. Calculate Salaries 2021/11/08

In [60]:
Salaries = pd.DataFrame([[1,1,"Tony",2000],[1,2,"Pronub",21300],[1,3,"Tyrrox",10800],[2,1,"Pam",300],\
[2,7,"Bassem",450], [2,9,"Hermione",700],[3,7,"Bocaben",100],[3,2,"Ognjen",2200],\
                     [3,13,"Nyancat",3300],[3,15,"Morninngcat",7777]],\
                      columns=["company_id","employee_id","employee_name","salary"] )

In [61]:
df = Salaries.merge(Salaries.groupby(['company_id'])['salary'].max().reset_index(name='max_salary'),how='left',on='company_id')

In [62]:
conditions={
0: df['max_salary']<1000,\
0.24: (df['max_salary']>=1000) & (df['max_salary']<=10000),\
0.49:(df['max_salary']>10000)
}
df['tax']=np.select(conditions.values(), conditions.keys(), default='Partial').astype('float64')

In [63]:
df['salary']=(df['salary']*(1-df['tax'])).round(0)

In [64]:
df.iloc[:,:4]

   company_id  employee_id employee_name   salary
0           1            1          Tony   1020.0
1           1            2        Pronub  10863.0
2           1            3        Tyrrox   5508.0
3           2            1           Pam    300.0
4           2            7        Bassem    450.0
5           2            9      Hermione    700.0
6           3            7       Bocaben     76.0
7           3            2        Ognjen   1672.0
8           3           13       Nyancat   2508.0
9           3           15   Morninngcat   5911.0